{
  "ancestors": [
    "android.widget.FrameLayout",
    "android.view.ViewGroup",
    "android.view.View",
    "java.lang.Object"
  ],
  "class": "com.android.internal.policy.PhoneWindow$DecorView",
  "bounds": [
    0,
    0,
    1440,
    2560
  ],
  "clickable": false,
  "children": [
    {
      "ancestors": [
        "android.widget.ImageView",
        "android.view.View",
        "java.lang.Object"
      ],
      "bounds": [
        0,
        84,
        1440,
        2392
      ],
      "clickable": false,
      "class": "android.support.v7.widget.AppCompatImageView",
      "componentLabel": "Background Image"
    },
    {
      "iconClass": "arrow_backward",
      "ancestors": [
        "android.widget.ImageView",
        "android.view.View",
        "java.lang.Object"
      ],
      "resource-id": "com.coinbase.android:id/login_back_button",
      "clickable": true,
      "class": "android.support.v7.widget.AppCompatImageView",
      "bounds": [
        0,
        84,
        196,
        280
      ],
      "componentLabel": "Icon"
    },
    {
      "text": "Accept Terms",
      "ancestors": [
        "android.widget.TextView",
        "android.view.View",
        "java.lang.Object"
      ],
      "clickable": false,
      "class": "android.support.v7.widget.AppCompatTextView",
      "bounds": [
        196,
        135,
        629,
        228
      ],
      "componentLabel": "Text"
    },
    {
      "iconClass": "check",
      "ancestors": [
        "android.widget.ImageView",
        "android.view.View",
        "java.lang.Object"
      ],
      "resource-id": "com.coinbase.android:id/imageView8",
      "clickable": false,
      "class": "android.support.v7.widget.AppCompatImageView",
      "bounds": [
        615,
        434,
        825,
        644
      ],
      "componentLabel": "Icon"
    },
    {
      "text": "Accept Terms",
      "resource-id": "com.coinbase.android:id/textView9",
      "ancestors": [
        "android.widget.TextView",
        "android.view.View",
        "java.lang.Object"
      ],
      "clickable": false,
      "class": "android.support.v7.widget.AppCompatTextView",
      "bounds": [
        547,
        672,
        892,
        748
      ],
      "componentLabel": "Text"
    },
    {
      "text": "Part 1. General Use Basic Coinbase Services Creating a Coinbase Account Hosted Digital Currency Wallet Conversion Services USD Wallet General Use, Prohibited Use, and Termination Customer Feedback, Queries, Complaints, and Dispute Resolution General Provisions Appendix 1. Prohibited Businesses and Prohibited Use Appendix 2. Verification Procedures Appendix 3: E-Sign Disclosure and Consent Appendix 4: State License Disclosures Part 2. Additional Terms for Merchants Merchant Services Merchant Transactions and Settlement Release, Restrictions, and General Use Part 3. GDAX GDAX Accounts Orders, Trades, and Fees General Use, Restrictions, and Cancellation Part 4. Additional Terms for Developers Developer’s Tools License Activities Subject to Additional Restrictions Intellectual Property and Ownership; Use of Marks API Calls and Compliance Updates and Support Security and Privacy \n\nCOINBASE USER AGREEMENT\n\nThis is a contract between you and Coinbase, Inc. (\"Coinbase\"). By signing up to use an account through coinbase.com or gdax.com, or any associated websites, APIs, or mobile applications (collectively the \"Coinbase Site\"), you agree that you have read, understood, and accept all of the terms and conditions contained in this Agreement, as well as our Privacy Policy and E-Sign Consent.\n\nLast updated: January 30, 2017\n\nPART 1: GENERAL USE\n\n1. Basic Coinbase Services.\n\n1.1. Eligibility. To be eligible to use the Coinbase Services, you must be at least 13 years old. In order to link a funding method or to purchase or sell digital currency, you must be at least 18 years old (or the applicable age of majority and contractual capacity). If you are under the age of 18 and you wish to engage in digital currency purchase or sale activity, please contact us at support@coinbase.com.\n\n1.2. Coinbase Services. Your Coinbase account (\"Coinbase Account\") encompasses the following basic Coinbase services: One or more hosted Digital Currency wallets that allow users to store certain supported digital currencies, like Bitcoin or Ethereum (\"Digital Currency\"), and to track, transfer, and manage supported Digital Currencies (the \"Hosted Digital Currency Wallet\"); Digital Currency conversion services through which users can buy and sell Digital Currencies in transactions with Coinbase (the \"Conversion Services\"); and a U.S. Dollar account for use in connection with other Coinbase Services (a \"USD Wallet\" or \"Currency Wallet\") and for eligible users, a Digital Currency exchange platform (\"GDAX\") (collectively the \"Coinbase Services\"). The risk of loss in trading or holding Digital Currency can be substantial. You should therefore carefully consider whether trading or holding Digital Currency is suitable for you in light of your financial condition.\n\n2. Creating a Coinbase Account.\n\n2.1. Registration of Coinbase Account. In order to use any of the Coinbase Services, you must first register by providing your name, an e-mail address, password, and affirming your acceptance of this Agreement. Coinbase may, in our sole discretion, refuse to allow you to establish a Coinbase Account, or limit the number of Coinbase Accounts that a single user may establish and maintain at any time.\n\n2.2. Identity Verification. In order to use certain features of the Coinbase Services, including certain transfers of digital and/or local currency, you may be required to provide Coinbase with certain personal information, including, but not limited to, your name, address, telephone number, e-mail address, date of birth, taxpayer identification number, government identification number, and information regarding your bank account (e.g., financial institution, account type, routing number, and account number). In submitting this or any other personal information as may be required, you verify that the information is accurate and authentic, and you agree to update Coinbase if any information changes. You hereby authorize Coinbase to, directly or through third parties make any inquiries we consider necessary to verify your identity and/or protect against fraud, including to query identity information contained in public reports (e.g., your name, address, past addresses, or date of birth), to query account information associated with your linked bank account (e.g., name or account balance), and to take action we reasonably deem necessary based on the results of such inquiries and reports. You further authorize any and all third parties to which such inquiries or requests may be directed to fully respond to such inquiries or requests.\n\n3. Hosted Digital Currency Wallet.\n\n3.1. In General. The Hosted Digital Currency Wallet services allow you to send supported Digital Currency to, and request, receive, and store supported Digital Currency from, third parties pursuant to instructions you provide through the Coinbase Site (each such transaction is a \"Digital Currency Transaction\").Coinbase reserves the right to refuse to process or to cancel any pending Digital Currency Transaction as required by law or in response to a subpoena, court order, or other binding government order or to enforce transaction limits. Coinbase cannot reverse a Digital Currency Transaction which has been broadcast to a Digital Currency network. The Hosted Digital Currency Wallet services are available only in connection with those Digital Currencies that Coinbase, in its sole discretion, decides to support. The Digital Currencies that Coinbase supports may change from time to time. If you have any questions about which Digital Currencies Coinbase currently supports, please contact support@coinbase.com. Under no circumstances should you attempt to use your Hosted Digital Currency Wallet services to store, send, request, or receive digital currencies in any form that are not supported by Coinbase. Coinbase assumes no responsibility or liability in connection with any attempt to use Coinbase Services for digital currencies that Coinbase does not support.\n\n3.2. Digital Currency Transactions. Coinbase processes supported Digital Currency according to the instructions received from its users and we do not guarantee the identity of any user, receiver, requestee or other party. You should verify all transaction information prior to submitting instructions to Coinbase. In the event you initiate a Digital Currency Transaction by entering the recipient's email address and the recipient does not have an existing Coinbase Account, Coinbase will email the recipient and invite them to open a Coinbase Account. If the designated recipient does not open a Coinbase Account within 30 days, Coinbase will return the supported Digital Currency associated with the transaction to your Coinbase Account. Once submitted to a Digital Currency network, a Digital Currency Transaction will be unconfirmed for a period of time pending sufficient confirmation of the transaction by the Digital Currency network. A transaction is not complete while it is in a pending state. Funds associated with transactions that are in a pending state will be designated accordingly, and will not be included in your Coinbase Account balance or be available to conduct transactions.\n\n3.3. Digital Currency Storage & Transmission Delays. Coinbase securely stores all Digital Currency private keys in our control in a combination of online and offline storage. As a result, it may be necessary for Coinbase to retrieve certain information from offline storage in order to facilitate a Digital Currency Transaction in accordance with your instructions, which may delay the initiation or crediting of such Digital Currency Transaction for 48 hours or more. You acknowledge and agree that a Digital Currency Transaction facilitated by Coinbase may be delayed.\n\n3.4. Third Party Payments. Coinbase has no control over, or liability for, the delivery, quality, safety, legality or any other aspect of any goods or services that you may purchase or sell to or from a third party (including other users of Coinbase Services). Coinbase is not responsible for ensuring that a buyer or a seller you may transact with will actually complete the transaction or is authorized to do so. If you experience a problem with any goods or services purchased from, or sold to, a third party in connection with Digital Currency transferred using the Coinbase Services, or if you have a dispute with such third party, you must resolve the dispute directly with that third party. If you believe a third party has behaved in a fraudulent, misleading, or inappropriate manner, or if you cannot adequately resolve a dispute with a third party, you may notify Coinbase Support at support@coinbase.com so that we may consider what action to take, if any.\n\n3.5. Coinbase Vault. You may elect to use the Coinbase Vault to store supported Digital Currency. The Coinbase Vault allows users to set withdrawal time-delays and/or to require the electronic approval of multiple individuals designated by the user before transfers may be completed. Coinbase also offers an advanced Vault which allows users the option to view, control, and distribute private keys of associated Digital Currency to multiple third parties whose majority approval will be required to transfer associated Digital Currency (the \"Multisig Vault\"). Coinbase cannot restore encrypted private keys or otherwise recover private keys which are not within Coinbase's control. If you use the Multisig Vault you acknowledge that Coinbase is not responsible for transferring, safeguarding, or maintaining private keys and/or Digital Currency associated with the Vault. If you and/or co-signing authorities lose, mishandle, or have stolen associated Digital Currency private keys, or if your cosigners refuse to provide requisite authority, you acknowledge that you may not be able to recover associated Digital Currency, and that Coinbase is not responsible for such loss.\n\n3.6. Customized Coinbase Payment Page. In some cases, you may establish a customizable payment page (\"Payment Page\") which will allow others to easily send Digital Currency to your Coinbase Account. You may establish and customize your Payment Page through your Coinbase Account settings, which will allow you to establish a user handle and associated Payments Page URL, upload a photo, and provide a short description. In establishing your Payment Page and uploading or adding any text, photo, or other material, you agree that you will not (i) post misleading materials or misappropriate the identity of another person or entity, (ii) post any copyrighted material which you are not authorized to post, or (iii) post any profane, unlawful, or offensive materials. Coinbase, in its sole discretion, may disable your Payment Page and take other action in accordance with this Agreement if we believe you are in violation of the foregoing or abusing this service. Coinbase may reclaim user handles associated with dormant Coinbase Accounts. Coinbase does not guarantee or endorse the purported identity, message, or other information posted by a user to the user's Payment Page.\n\n3.7 Advanced Protocols. Unless specifically announced on our website or through some other official public statement of Coinbase, we do not support metacoins, colored coins, side chains, or other derivative, enhanced, or forked protocols, tokens, or coins which supplement or interact with a Digital Currency supported by Coinbase (collectively, “Advanced Protocols”). Do not use your Coinbase Account or GDAX account to attempt to receive, request, send, store, or engage in any other type of transaction involving an Advanced Protocol. The Coinbase platform is not configured to detect and/or secure Advanced Protocol transactions and Coinbase assumes absolutely no responsibility whatsoever in respect to Advanced Protocols.\n\n3.8 Operation of Digital Currency Protocols. Coinbase does not own or control the underlying software protocols which govern the operation of Digital Currencies supported on our platform. In general, the underlying protocols are open source and anyone can use, copy, modify, and distribute them. By using the Coinbase or GDAX platforms, you acknowledge and agree (i) that Coinbase is not responsible for operation of the underlying protocols and that Coinbase makes no guarantee of their functionality, security, or availability; and (ii) that the underlying protocols are subject to sudden changes in operating rules (a/k/a “forks”), and that such forks may materially affect the value, function, and/or even the name of the Digital Currency you store in the Coinbase platform. In the event of a fork, you agree that Coinbase may temporarily suspend Coinbase operations (with our without advance notice to you) and that Coinbase may, in its sole discretion, (a) configure or reconfigure its systems or (b) decide not to support (or cease supporting) the forked protocol entirely, provided, however, that you will have an opportunity to withdraw funds from the platform. You acknowledge and agree that Coinbase assumes absolutely no responsibility whatsoever in respect of an unsupported branch of a forked protocol.\n\n4. Conversion Services.\n\n4.1. In General. Eligible users in certain jurisdictions may buy or sell supported Digital Currency through the Conversion Services. The Conversion Services are subject to the Coinbase \"Conversion Rate\" for the given transaction. \"Conversion Rate\" means the price of a given supported Digital Currency amount in terms of local currency or other Digital Currency as quoted on the Coinbase Site. The Conversion Rate is stated either as a \"Buy Price\" or as a \"Sell Price,\" which is the price in terms of local currency or Digital Currency at which you may buy or sell supported Digital Currency to Coinbase. You acknowledge that the quoted Buy Price Conversion Rate may not be the same as the Sell Price Conversion Rate at any given time, and that Coinbase may add a margin or “spread” to the quoted Conversion Rate. You agree, as a condition of using any Coinbase Conversion Services, to accept the Conversion Rate as the sole conversion metric. Coinbase reserves the right to delay any Conversion Service transaction if it perceives a risk of fraud or illegal activity. Coinbase does not guarantee the availability of its Conversion Service, and the act of purchasing supported Digital Currency from Coinbase does not result in a guarantee that you may sell your supported Digital Currency to Coinbase.\n\n4.2. Purchase Transactions. After successfully completing the Verification Procedures, you may purchase supported Digital Currency by linking a valid payment method. You authorize Coinbase to initiate debits from your selected payment method(s) in settlement of purchase transactions. A Conversion Service Fee (defined below) applies to all purchase transactions. Although Coinbase will attempt to deliver supported Digital Currency to you as promptly as possible, funds may be debited from your selected payment method before Digital Currency is delivered to your Coinbase Account. We will make best efforts to fulfill all transactions, but in the rare circumstance where Coinbase cannot fulfill your purchase order, we will notify you and seek your approval to fulfill the purchase order at the contemporaneous Buy Price Conversion Rate. To secure the performance of your obligations under this Agreement, you grant to Coinbase a lien on and security interest in and to the balances in your account.\n\n4.3. Sale Transactions. After successfully completing the Verification Procedures, you may sell supported Digital Currency by linking a valid payment method. You authorize Coinbase to debit your Coinbase Account(s) and initiate payments to your selected payment method(s) in settlement of sell transactions. An applicable Conversion Fee (defined below) applies to all sale transactions. Your receipt of funds will depend on the payment type, and may take up to three or more business days.\n\n4.4. Service Fees. Each Conversion Service transaction is subject to a fee (a \"Service Fee,\" also referred to as a \"Conversion Fee\"). The applicable Service Fee is displayed to you on the Coinbase Site prior to you completing a Conversion Service transaction. Service Fees and Conversion Service transactions may depend on the following factors:\n\nCoinbase will not process a conversion transaction if the Service Fee exceeds the value of your transaction.Payments using other methods not described below, such as wire (if permitted), are subject to different transaction fees disclosed to you before you authorize the transaction. \n\nCoinbase may waive some portion of the Service Fee depending on the payment method you select. The availability of each Payment Method depends on a number of factors, including but not limited to your location, the identification information you have provided to us, and limitations imposed by third party payment processors. \n\nYou can view the current fee applicable to your location and payment method at our Fees page. \n\nCoinbase reserves the right to adjust its Service Fees and any applicable waivers. We will always notify you of the Service Fee which applies to your transaction, both at the time of the transaction and in each receipt we issue to you.\n\n4.5. Reversals; Cancellations. You cannot cancel, reverse, or change any transaction marked as complete or pending. If your payment is not successful or if your payment method has insufficient funds, you authorize Coinbase, in its sole discretion, either to cancel the transaction or to debit your other payment methods, including Coinbase balances or other linked accounts, in any amount necessary to complete the transaction. You are responsible for maintaining an adequate balance and/or sufficient credit limits in order to avoid overdraft, NSF, or similar fees charged by your payment provider. Coinbase reserves the right to refuse to process, or to cancel or reverse, any purchases or sales of Digital Currency in its sole discretion, even after funds have been debited from your account(s), if Coinbase suspects the transaction involves (or has a high risk of involvement in) money laundering, terrorist financing, fraud, or any other type of financial crime; in response to a subpoena, court order, or other government order; or if Coinbase suspects the transaction relates to Prohibited Use or a Prohibited Business as set forth below. In such instances, Coinbase will reverse the transaction and we are under no obligation to allow you to reinstate a purchase or sale order at the same price or on the same terms as the cancelled transaction.\n\n4.6. Recurring Transactions. If you initiate recurring Conversion Service transactions, you authorize Coinbase to initiate recurring electronic payments in accordance with your selected Conversion Service and any corresponding payment accounts, such as recurring automated clearing house (ACH) debit or credit entries from or to your linked bank account. Your recurring transactions will occur in identical, periodic installments, based on your period selection (e.g., daily, weekly, monthly), until either you or Coinbase cancels the recurring order. If you select a U.S. Bank Account as your payment method for a recurring transaction, and such transaction falls on a weekend or holiday, or after bank business hours, the ACH credit or debit will be executed on the next business day, although the Digital Currency Conversion Rate at the time of the regularly-scheduled transaction will apply. If your Bank is unable to process any electronic ACH debit entry, Coinbase will notify you of cancellation of the transaction and may avail itself of remedies set forth in this User Agreement to recover any amount owed to Coinbase. This authorization will remain in full force and effect until you change your recurring transaction settings at https://www.coinbase.com/recurring_payments, or until you provide us written notification at support@coinbase.com. You agree to notify Coinbase in writing of any changes in your linked bank account information prior to a recurring transaction. Coinbase may, at any time, terminate recurring transactions by providing notice to you.\n\n4.7. Payment Services Partners. Coinbase may use a third party payment processor to process any US Dollar payment between you and Coinbase, including but not limited to payments in relation to your use of the Conversion Service or deposits or withdrawals from your USD Wallet or GDAX Account. Without limiting the foregoing, Coinbase may engage Synapse Payments, LLC (\"SynapsePay\") to perform any of the above payment functions, in which case you agree to be bound by the SynapsePay Terms of Service, available at https://synapsepay.com/legal. Coinbase is not directly supported, endorsed, or certified by SynapsePay. SynapsePay gives no warranties and makes no claims about Coinbase.\n\n5. USD Wallet.\n\n5.1. USD Wallets. Certain approved users may establish and fund a U.S. Dollar balance (\"USD Wallet\") to facilitate transactions on the Coinbase or GDAX platforms. You are the owner of the balance of your USD Wallet. Coinbase holds your USD balance in dedicated custodial accounts with a financial institution.\n\n5.2. Deposits and Withdrawals. You may initiate a transfer from your linked bank account to fund your USD Wallet. Coinbase will not charge a fee for you to transfer funds to or from Coinbase, but bank transfer fees may apply. Funds sent via bank wire (if permitted by Coinbase) are subject to additional wire fees. For deposits, Coinbase will credit your USD Wallet a corresponding amount of dollars after funds are delivered to Coinbase, typically within two to three business days after you authorize a deposit. For withdrawals, Coinbase will immediately debit your USD Wallet when you authorize a withdrawal and funds will typically settle to you within two to three business days. Bank fees are netted out of transfers to or from Coinbase. We will not process a transfer if associated bank fees exceed the value of the transfer.\n\n6. General Use, Prohibited Use, and Termination.\n\n6.1. Limited License. We grant you a limited, nonexclusive, nontransferable license, subject to the terms of this Agreement, to access and use the Coinbase Site, and related content, materials, information (collectively, the \"Content\") solely for approved purposes as permitted by Coinbase from time to time. Any other use of the Coinbase Site or Content is expressly prohibited and all other right, title, and interest in the Coinbase Site or Content is exclusively the property of Coinbase and its licensors. You agree you will not copy, transmit, distribute, sell, license, reverse engineer, modify, publish, or participate in the transfer or sale of, create derivative works from, or in any other way exploit any of the Content, in whole or in part. \"Coinbase.com\", \"Coinbase\", \"GDAX\", “gdax.com\" and all logos related to the Coinbase Services or displayed on the Coinbase Site are either trademarks or registered marks of Coinbase or its licensors. You may not copy, imitate or use them without Coinbase's prior written consent.\n\n6.2. Website Accuracy. Although we intend to provide accurate and timely information on the Coinbase Site, the Coinbase Site (including, without limitation, the Content) may not always be entirely accurate, complete or current and may also include technical inaccuracies or typographical errors. In an effort to continue to provide you with as complete and accurate information as possible, information may be changed or updated from time to time without notice, including without limitation information regarding our policies, products and services. Accordingly, you should verify all information before relying on it, and all decisions based on information contained on the Coinbase Site are your sole responsibility and we shall have no liability for such decisions. Links to third-party materials (including without limitation websites) may be provided as a convenience but are not controlled by us. You acknowledge and agree that we are not responsible for any aspect of the information, content, or services contained in any third-party materials or on any third party sites accessible or linked to the Coinbase Site,\n\n6.3. Third-Party Applications. If, to the extent permitted by Coinbase from time to time, you grant express permission to a third party to access or connect to your Coinbase Account, either through the third party's product or service or through the Coinbase Site, you acknowledge that granting permission to a third party to take specific actions on your behalf does not relieve you of any of your responsibilities under this Agreement. You are fully responsible for all acts or omissions of any third party with access to your Coinbase Account. Further, you acknowledge and agree that you will not hold Coinbase responsible for, and will indemnify Coinbase from, any liability arising out of or related to any act or omission of any third party with access to your Coinbase Account. You may change or remove permissions granted by you to third parties with respect to your Coinbase Account at any time through the Account Settings (Integrations) page on the Coinbase Site.\n\n6.4. Prohibited Use. In connection with your use of the Coinbase Services, and your interactions with other users, and third parties you agree and represent you will not engage in any Prohibited Business or Prohibited Use defined herein. We reserve the right at all times to monitor, review, retain and/or disclose any information as necessary to satisfy any applicable law, regulation, sanctions programs, legal process or governmental request. We reserve the right to cancel and/or suspend your Coinbase Account and/or block transactions or freeze funds immediately and without notice if we determine, in our sole discretion, that your Account is associated with a Prohibited Use and/or a Prohibited Business.\n\n6.5. Transactions Limits. The use of all Coinbase Services is subject to a limit on the amount of volume, stated in U.S. Dollar terms, you may transact or transfer in a given period (e.g., daily). To view your limits, login to your Coinbase Account and visit https://www.coinbase.com/verifications. Your transaction limits may vary depending on your payment method, verification steps you have completed, and other factors. Coinbase reserves the right to change applicable limits as we deem necessary in our sole discretion. If you wish to raise your limits beyond the posted amounts, you may submit a request to support@coinbase.com. We may require you to submit additional information about yourself or your business, provide records, and arrange for meetings with Coinbase staff (such process, \"Enhanced Due Diligence\"). Coinbase reserves the right to charge you costs and fees associated with Enhanced Due Diligence, provided that we notify you in advance of any such charges accruing. In our sole discretion, we may refuse to raise your limits or we may lower your limits at a subsequent time even if you have completed Enhanced Due Diligence.\n\n6.6. Suspension, Termination, and Cancellation. Coinbase may: (a) suspend, restrict, or terminate your access to any or all of the Coinbase Services, and/or (b) deactivate or cancel your Coinbase Account if:\n\nWe are so required by a facially valid subpoena, court order, or binding order of a government authority; orWe reasonably suspect you of using your Coinbase Account in connection with a Prohibited Use or Business; orUse of your Coinbase Account is subject to any pending litigation, investigation, or government proceeding and/or we perceive a heightened risk of legal or regulatory non-compliance associated with your Account activity; orOur service partners are unable to support your use; orYou take any action that Coinbase deems as circumventing Coinbase's controls, including, but not limited to, opening multiple Coinbase Accounts or abusing promotions which Coinbase may offer from time to time. \n\nIf Coinbase suspends or closes your account, or terminates your use of Coinbase Services for any reason, we will provide you with notice of our actions unless a court order or other legal process prohibits Coinbase from providing you with such notice. You acknowledge that Coinbase's decision to take certain actions, including limiting access to, suspending, or closing your account, may be based on confidential criteria that are essential to Coinbase's risk management and security protocols. You agree that Coinbase is under no obligation to disclose the details of its risk management and security procedures to you.\n\nYou will be permitted to transfer Digital Currency or funds associated with your Hosted Digital Currency Wallet(s) and/or your USD Wallet(s) for ninety (90) days after Account deactivation or cancellation unless such transfer is otherwise prohibited (i) under the law, including but not limited to applicable sanctions programs, or (ii) by a facially valid subpoena or court order. You may cancel your Coinbase Account at any time by withdrawing all balances and visiting https://www.coinbase.com/settings/cancel. You will not be charged for canceling your Coinbase Account, although you will be required to pay any outstanding amounts owed to Coinbase. You authorize us to cancel or suspend any pending transactions at the time of cancellation.\n\n6.7. Relationship of the Parties. Coinbase is an independent contractor for all purposes. Nothing in this Agreement shall be deemed or is intended to be deemed, nor shall it cause, you and Coinbase to be treated as partners, joint ventures, or otherwise as joint associates for profit, or either you or Coinbase to be treated as the agent of the other.\n\n6.8. Privacy of Others; Marketing. If you receive information about another user through the Coinbase Services, you must keep the information confidential and only use it in connection with the Coinbase Services. You may not disclose or distribute a user's information to a third party or use the information except as reasonably necessary to effectuate a transaction and other functions reasonably incidental thereto such as support, reconciliation and accounting unless you receive the user's express consent to do so. You may not send unsolicited email to a user through the Coinbase Services.\n\n6.9. Password Security; Contact Information. You are responsible for maintaining adequate security and control of any and all IDs, passwords, hints, personal identification numbers (PINs), API keys or any other codes that you use to access the Coinbase Services. Any loss or compromise of the foregoing information and/or your personal information may result in unauthorized access to your Coinbase Account by third-parties and the loss or theft of any Digital Currency and/or funds held in your Coinbase Account and any associated accounts, including your linked bank account(s) and credit card(s). You are responsible for keeping your email address and telephone number up to date in your Account Profile in order to receive any notices or alerts that we may send you. We assume no responsibility for any loss that you may sustain due to compromise of account login credentials due to no fault of Coinbase and/or failure to follow or act on any notices or alerts that we may send to you. In the event you believe your Coinbase Account information has been compromised, contact Coinbase Support immediately at support@coinbase.com, or report your claim by phone at (800) 343-5845.\n\n6.10. Taxes. It is your sole responsibility to determine whether, and to what extent, any taxes apply to any transactions you conduct through the Coinbase Services, and to withhold, collect, report and remit the correct amounts of taxes to the appropriate tax authorities. Your transaction history is available through your Coinbase Account.\n\n6.11. Unclaimed Property. If Coinbase is holding funds in your account, and Coinbase is unable to contact you and has no record of your use of the Services for several years, applicable law may require Coinbase to report these funds as unclaimed property to the applicable jurisdiction. If this occurs, Coinbase will try to locate you at the address shown in our records, but if Coinbase is unable to locate you, it may be required to deliver any such funds to the applicable state or jurisdiction as unclaimed property. Coinbase reserves the right to deduct a dormancy fee or other administrative charges from such unclaimed funds, as permitted by applicable law.\n\n7. Customer Feedback, Queries, Complaints, and Dispute Resolution\n\n7.1. Contact Coinbase. If you have any feedback, questions, or complaints, contact us via our Customer Support webpage at https://support.coinbase.com or write to us at Coinbase Customer Support, 548 Market Street, #23008, San Francisco, CA 94104, USA. When you contact us please provide us with your name, address, and any other information we may need to identify you, your Coinbase Account, and the transaction on which you have feedback, questions, or complaints. If you believe your account has been compromised, you may also report your claim by calling (800) 343-5845.\n\n7.2. Arbitration; Waiver of Class Action. If you have a dispute with Coinbase, we will attempt to resolve any such disputes through our support team. If we cannot resolve the dispute through our support team, you and we agree that any dispute arising under this Agreement shall be finally settled in binding arbitration, on an individual basis, in accordance with the American Arbitration Association's rules for arbitration of consumer-related disputes (accessible at https://www.adr.org/aaa/faces/rules) and you and Coinbase hereby expressly waive trial by jury and right to participate in a class action lawsuit or class-wide arbitration. The arbitration will be conducted by a single, neutral arbitrator and shall take place in the county or parish in which you reside, or another mutually agreeable location, in the English language. The arbitrator may award any relief that a court of competent jurisdiction could award, including attorneys' fees when authorized by law, and the arbitral decision may be enforced in any court. At your request, hearings may be conducted in person or by telephone and the arbitrator may provide for submitting and determining motions on briefs, without oral hearings. The prevailing party in any action or proceeding to enforce this agreement shall be entitled to costs and attorneys' fees.\n\nIf the arbitrator(s) or arbitration administrator would impose filing fees or other administrative costs on you, we will reimburse you, upon request, to the extent such fees or costs would exceed those that you would otherwise have to pay if you were proceeding instead in a court. We will also pay additional fees or costs if required to do so by the arbitration administrator's rules or applicable law. Apart from the foregoing, each Party will be responsible for any other fees or costs, such as attorney fees that the Party may incur. If a court decides that any provision of this section 8.2 is invalid or unenforceable, that provision shall be severed and the other parts of this section 8.2 shall still apply. In any case, the remainder of this User Agreement, will continue to apply.\n\n8. General Provisions.\n\n8.1. Computer Viruses. We shall not bear any liability, whatsoever, for any damage or interruptions caused by any computer viruses, spyware, scareware, Trojan horses, worms or other malware that may affect your computer or other equipment, or any phishing, spoofing or other attack. We advise the regular use of a reputable and readily available virus screening and prevention software. You should also be aware that SMS and email services are vulnerable to spoofing and phishing attacks and should use care in reviewing messages purporting to originate from Coinbase. Always log into your Coinbase Account through the Coinbase Site to review any transactions or required actions if you have any uncertainty regarding the authenticity of any communication or notice.\n\n8.2. Release of Coinbase; Indemnification. If you have a dispute with one or more users of the Coinbase services, you release Coinbase, its affiliates and service providers, and each of their respective officers, directors, agents, joint venturers, employees and representatives from any and all claims, demands and damages (actual and consequential) of every kind and nature arising out of or in any way connected with such disputes. You agree to indemnify and hold Coinbase, its affiliates and Service Providers, and each of its or their respective officers, directors, agents, joint venturers, employees and representatives, harmless from any claim or demand (including attorneys' fees and any fines, fees or penalties imposed by any regulatory authority) arising out of or related to your breach of this Agreement or your violation of any law, rule or regulation, or the rights of any third party.\n\n8.3. Limitation of Liability; No Warranty. IN NO EVENT SHALL COINBASE, ITS AFFILIATES AND SERVICE PROVIDERS, OR ANY OF THEIR RESPECTIVE OFFICERS, DIRECTORS, AGENTS, JOINT VENTURERS, EMPLOYEES OR REPRESENTATIVES, BE LIABLE (A) FOR ANY AMOUNT GREATER THAN THE VALUE OF THE SUPPORTED DIGITAL CURRENCY ON DEPOSIT IN YOUR COINBASE ACCOUNT OR (B) FOR ANY LOST PROFITS OR ANY SPECIAL, INCIDENTAL, INDIRECT, INTANGIBLE, OR CONSEQUENTIAL DAMAGES, WHETHER BASED IN CONTRACT, TORT, NEGLIGENCE, STRICT LIABILITY, OR OTHERWISE, ARISING OUT OF OR IN CONNECTION WITH AUTHORIZED OR UNAUTHORIZED USE OF THE COINBASE SITE OR THE COINBASE SERVICES, OR THIS AGREEMENT, EVEN IF AN AUTHORIZED REPRESENTATIVE OF COINBASE HAS BEEN ADVISED OF OR KNEW OR SHOULD HAVE KNOWN OF THE POSSIBILITY OF SUCH DAMAGES. THIS MEANS, BY WAY OF EXAMPLE ONLY (AND WITHOUT LIMITING THE SCOPE OF THE PRECEDING SENTENCE), THAT IF YOU CLAIM THAT COINBASE FAILED TO PROCESS A BUY OR SELL TRANSACTION PROPERLY, YOUR DAMAGES ARE LIMITED TO NO MORE THAN THE VALUE OF THE SUPPORTED DIGITAL CURRENCY AT ISSUE IN THE TRANSACTION, AND THAT YOU MAY NOT RECOVER FOR LOST PROFITS, LOST BUSINESS OPPORTUNITES, OR OTHER TYPES OF SPECIAL, INCIDENTIAL, INDIRECT, INTANGIBLE, OR CONSEQUENTIAL DAMAGES IN EXCESS OF THE VALUE OF THE SUPPORTED DIGITAL CURRENCY AT ISSUE IN THE TRANSACTION. SOME JURISDICTIONS DO NOT ALLOW THE EXCLUSION OR LIMITATION OF INCIDENTAL OR CONSEQUENTIAL DAMAGES SO THE ABOVE LIMITATION MAY NOT APPLY TO YOU.\n\nTHE COINBASE SERVICES ARE PROVIDED ON AN \"AS IS\" AND \"AS AVAILABLE\" BASIS WITHOUT ANY REPRESENTATION OR WARRANTY, WHETHER EXPRESS, IMPLIED OR STATUTORY. TO THE MAXIMUM EXTENT PERMITTED BY APPLICABLE LAW, COINBASE SPECIFICALLY DISCLAIMS ANY IMPLIED WARRANTIES OF TITLE, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND/OR NON-INFRINGEMENT. COINBASE DOES NOT MAKE ANY REPRESENTATIONS OR WARRANTIES THAT ACCESS TO THE SITE, ANY PART OF THE COINBASE SERVICES, OR ANY OF THE MATERIALS CONTAINED THEREIN, WILL BE CONTINUOUS, UNINTERRUPTED, TIMELY, OR ERROR-FREE.\n\nCoinbase makes no representations about the accuracy or completeness of historical Digital Currency price data available on the Site. Coinbase will make reasonable efforts to ensure that requests for electronic debits and credits involving bank accounts, credit cards, and check issuances are processed in a timely manner but Coinbase makes no representations or warranties regarding the amount of time needed to complete processing which is dependent upon many factors outside of our control.\n\nIF YOU ARE A NEW JERSEY RESIDENT, the provisions of this Section 8.3 are intended to apply only to the extent permitted under New Jersey law.\n\n8.4. Entire Agreement. This Agreement, the Privacy Policy, E-Sign Consent, and Appendices incorporated by reference herein comprise the entire understanding and agreement between you and Coinbase as to the subject matter hereof, and supersedes any and all prior discussions, agreements and understandings of any kind (including without limitation any prior versions of this Agreement), and every nature between and among you and Coinbase. Section headings in this Agreement are for convenience only, and shall not govern the meaning or interpretation of any provision of this Agreement.\n\n8.5. Amendments. We may amend or modify this Agreement by posting on the Coinbase Site or emailing to you the revised Agreement, and the revised Agreement shall be effective at such time. If you do not agree with any such modification, your sole and exclusive remedy is to terminate your use of the Services and close your account. You agree that we shall not be liable to you or any third party for any modification or termination of the Coinbase Services, or suspension or termination of your access to the Coinbase Services, except to the extent otherwise expressly set forth herein. If the revised Agreement includes a material change, we will endeavor to provide you advanced notice via our website and/or email before the material change becomes effective.\n\n8.6. Assignment. You may not assign any rights and/or licenses granted under this Agreement. We reserve the right to assign our rights without restriction, including without limitation to any Coinbase affiliates or subsidiaries, or to any successor in interest of any business associated with the Coinbase Services. Any attempted transfer or assignment in violation hereof shall be null and void. Subject to the foregoing, this Agreement will bind and inure to the benefit of the parties, their successors and permitted assigns.\n\n8.7. Severability. If any provision of this Agreement shall be determined to be invalid or unenforceable under any rule, law or regulation or any governmental agency, local, state, or federal, such provision will be changed and interpreted to accomplish the objectives of the provision to the greatest extent possible under any applicable law and the validity or enforceability of any other provision of this Agreement shall not be affected.\n\n8.8. Change of Control. In the event that Coinbase is acquired by or merged with a third party entity, we reserve the right, in any of these circumstances, to transfer or assign the information we have collected from you as part of such merger, acquisition, sale, or other change of control.\n\n8.9. Survival. All provisions of this Agreement which by their nature extend beyond the expiration or termination of this Agreement, including, without limitation, sections pertaining to suspension or termination, Coinbase Account cancellation, debts owed to Coinbase, general use of the Coinbase Site, disputes with Coinbase, and general provisions, shall survive the termination or expiration of this Agreement.\n\n8.10. Governing Law. You agree that the laws of the State of California, without regard to principles of conflict of laws, will govern this Agreement and any claim or dispute that has arisen or may arise between you and Coinbase, except to the extent governed by federal law.\n\n8.11. Force Majeure. We shall not be liable for delays, failure in performance or interruption of service which result directly or indirectly from any cause or condition beyond our reasonable control, including but not limited to, any delay or failure due to any act of God, act of civil or military authorities, act of terrorists, civil disturbance, war, strike or other labor dispute, fire, interruption in telecommunications or Internet services or network provider services, failure of equipment and/or software, other catastrophe or any other occurrence which is beyond our reasonable control and shall not affect the validity and enforceability of any remaining provisions.\n\n8.12. English Language Controls. Notwithstanding any other provision of this Agreement, any translation of this Agreement is provided for your convenience. The meanings of terms, conditions and representations herein are subject to definitions and interpretations in the English language. Any translation provided may not accurately represent the information in the original English.\n\n8.13. Non-Waiver of Rights. This agreement shall not be construed to waive rights that cannot be waived under applicable state money transmission laws in the state where you are located.\n\nAPPENDIX 1: PROHIBITED Use, PROHIBITED Businesses, and conditional use\n\nProhibited Use\n\nYou may not use your Coinbase Account to engage in the following categories of activity (\"Prohibited Uses\"). The specific types of use listed below are representative, but not exhaustive. If you are uncertain as to whether or not your use of Coinbase Services involves a Prohibited Use, or have questions about how these requirements apply to you, please contact us at support@coinbase.com. By opening a Coinbase Account, you confirm that you will not use your Account to do any of the following:\n\nUnlawful Activity: Activity which would violate, or assist in violation of, any law, statute, ordinance, or regulation, sanctions programs administered in the countries where Coinbase conducts business, including but not limited to the U.S. Department of Treasury's Office of Foreign Assets Control (\"OFAC\"), or which would involve proceeds of any unlawful activity; publish, distribute or disseminate any unlawful material or information\n\nAbusive Activity: Actions which impose an unreasonable or disproportionately large load on our infrastructure, or detrimentally interfere with, intercept, or expropriate any system, data, or information; transmit or upload any material to the Coinbase Site that contains viruses, trojan horses, worms, or any other harmful or deleterious programs; attempt to gain unauthorized access to the Coinbase Site, other Coinbase Accounts, computer systems or networks connected to the Coinbase Site, through password mining or any other means; use Coinbase Account information of another party to access or use the Coinbase Site, except in the case of specific Merchants and/or applications which are specifically authorized by a user to access such user's Coinbase Account and information; or transfer your account access or rights to your account to a third party, unless by operation of law or with the express permission of Coinbase\n\nAbuse Other Users: Interfere with another individual's or entity's access to or use of any Coinbase Services; defame, abuse, extort, harass, stalk, threaten or otherwise violate or infringe the legal rights (such as, but not limited to, rights of privacy, publicity and intellectual property) of others; incite, threaten, facilitate, promote, or encourage violent acts against others; harvest or otherwise collect information from the Coinbase Site about others, including without limitation email addresses, without proper consent\n\nFraud: Activity which operates to defraud Coinbase, Coinbase users, or any other person; provide any false, inaccurate, or misleading information to Coinbase\n\nGambling: Lotteries; bidding fee auctions; sports forecasting or odds making; fantasy sports leagues with cash prizes; internet gaming; contests; sweepstakes; games of chance\n\nIntellectual Property Infringement: Engage in transactions involving items that infringe or violate any copyright, trademark, right of publicity or privacy or any other proprietary right under the law, including but not limited to sales, distribution, or access to counterfeit music, movies, software, or other licensed materials without the appropriate authorization from the rights holder; use of Coinbase intellectual property, name, or logo, including use of Coinbase trade or service marks, without express consent from Coinbase or in a manner that otherwise harms Coinbase or the Coinbase brand; any action that implies an untrue endorsement by or affiliation with Coinbase\n\nProhibited Businesses\n\nIn addition to the Prohibited Uses described above, the following categories of businesses, business practices, and sale items are barred from Coinbase Services (\"Prohibited Businesses\"). Most Prohibited Businesses categories are imposed by Card Network rules or the requirements of our banking providers or processors. The specific types of use listed below are representative, but not exhaustive. If you are uncertain as to whether or not your use of Coinbase Services involves a Prohibited Business, or have questions about how these requirements apply to you, please contact us at support@coinbase.com.\n\nBy opening a Coinbase Account, you confirm that you will not use Coinbase Services in connection with any of following businesses, activities, practices, or items:\n\nInvestment and Credit Services: Securities brokers; mortgage consulting or debt reduction services; credit counseling or repair; real estate opportunities; investment schemes\n\nRestricted Financial Services: Check cashing, bail bonds; collections agencies.\n\nIntellectual Property or Proprietary Rights Infringement: Sales, distribution, or access to counterfeit music, movies, software, or other licensed materials without the appropriate authorization from the rights holder\n\nCounterfeit or Unauthorized Goods: Unauthorized sale or resale of brand name or designer products or services; sale of goods or services that are illegally imported or exported or which are stolen\n\nRegulated Products and Services: Marijuana dispensaries and related businesses; sale of tobacco, e-cigarettes, and e-liquid; online prescription or pharmaceutical services; age restricted goods or services; weapons and munitions; gunpowder and other explosives; fireworks and related goods; toxic, flammable, and radioactive materials; products and services with varying legal status on a state-by-state basis\n\nDrugs and Drug Paraphernalia: Sale of narcotics, controlled substances, and any equipment designed for making or using drugs, such as bongs, vaporizers, and hookahs\n\nPseudo-Pharmaceuticals: Pharmaceuticals and other products that make health claims that have not been approved or verified by the applicable local and/or national regulatory body\n\nSubstances designed to mimic illegal drugs: Sale of a legal substance that provides the same effect as an illegal drug (e.g., salvia, kratom)\n\nAdult Content and Services: Pornography and other obscene materials (including literature, imagery and other media); sites offering any sexually-related services such as prostitution, escorts, pay-per view, adult live chat features\n\nMulti-level Marketing: Pyramid schemes, network marketing, and referral marketing programs\n\nUnfair, predatory or deceptive practices: Investment opportunities or other services that promise high rewards; Sale or resale of a service without added benefit to the buyer; resale of government offerings without authorization or added value; sites that we determine in our sole discretion to be unfair, deceptive, or predatory towards consumers\n\nHigh risk businesses: any businesses that we believe poses elevated financial risk, legal liability, or violates card network or bank policies\n\nConditional Use\n\nExpress written consent and approval from Coinbase must be obtained prior to using Coinbase Services for the following categories of business and/or use (\"Conditional Uses\"). Consent may be requested by contacting support@coinbase.com. Coinbase may also require you to agree to additional conditions, make supplemental representations and warranties, complete enhanced on-boarding procedures, and operate subject to restrictions if you use Coinbase Services in connection with any of following businesses, activities, or practices:\n\nMoney Services: Money transmitters, Digital Currency transmitters; currency or Digital Currency exchanges or dealers; gift cards; prepaid cards; sale of in-game currency unless the merchant is the operator of the virtual world; act as a payment intermediary or aggregator or otherwise resell any of the Coinbase Services\n\nCharities: Acceptance of donations for nonprofit enterprise\n\nGames of Skill: Games which are not defined as gambling under this Agreement or by law, but which require an entry fee and award a prize\n\nReligious/Spiritual Organizations: Operation of a for-profit religious or spiritual organization\n\nAPPENDIX 2: VERIFICATION PROCEDURES AND LIMITS\n\nCoinbase uses multi-level systems and procedures to collect and verify information about you in order to protect Coinbase and the community from fraudulent users, and to keep appropriate records of Coinbase's customers. Your daily or weekly Conversion limits, GDAX deposit, withdrawal and trading limits, Instant Buy limits, USD Wallet transfer limits, and limits on transactions from a linked payment method are based on the identifying information and/or proof of identity you provide to Coinbase.\n\nAll U.S. users who wish to buy Digital Currency using Coinbase's Standard Conversion Service, at minimum, must:\n\nEstablish a Coinbase Account by providing your name, authenticating your e-mail address, and accepting the Coinbase User TermsAdd and verify a phone numberAdd and verify a bank account \n\nAll U.S. users who wish to use other Coinbase Services may be required to:\n\nAdd personal details (full name, date of birth, residential address)Add an alternative payment methodComplete identity verification by answering a few questions \n\nUsers based in the state of New York using Coinbase's Hosted Digital Currency Wallet Service who wish to execute a Digital Currency Transaction valued at or over $3,000 at the time the transaction is requested, at a minimum, must:\n\nEstablish a Coinbase Account by providing your name and residential address, authenticating your e-mail address, and accepting the Coinbase User Terms, andSubmit a copy of an acceptable form of identification (i.e. passport, state driver's license, or state identification card) \n\nNotwithstanding these minimum verification procedures for the referenced Coinbase Services, Coinbase may require you to provide or verify additional information, or to wait some amount of time after completion of a transaction, before permitting you to use any Coinbase Services and/or before permitting you to engage in transactions beyond certain volume limits. You may determine the volume limits associated with your level of identity verification by visiting your account's Limits page.\n\nYou may contact support@coinbase.com to request larger limits. Coinbase will require you to submit to Enhanced Due Diligence. Additional fees and costs may apply, and Coinbase does not guarantee that we will raise your limits.\n\nAPPENDIX 3: E-SIGN DISCLOSURE AND CONSENT\n\nThis policy describes how Coinbase delivers communications to you electronically. We may amend this policy at any time by providing a revised version on our website. The revised version will be effective at the time we post it. We will provide you with prior notice of any material changes via our website.\n\nElectronic Delivery of Communications\n\nYou agree and consent to receive electronically all communications, agreements, documents, notices and disclosures (collectively, \"Communications\") that we provide in connection with your Coinbase Account and your use of Coinbase Services. Communications include:\n\nTerms of use and policies you agree to (e.g., the Coinbase User Agreement and Privacy Policy), including updates to these agreements or policies;Account details, history, transaction receipts, confirmations, and any other Account or transaction information;Legal, regulatory, and tax disclosures or statements we may be required to make available to you; andResponses to claims or customer support inquiries filed in connection with your Account. \n\nWe will provide these Communications to you by posting them on the Coinbase website, emailing them to you at the primary email address listed in your Coinbase profile, communicating to you via instant chat, and/or through other electronic communication such as text message or mobile push notification.\n\nHardware and Software Requirements\n\nIn order to access and retain electronic Communications, you will need the following computer hardware and software:\n\nA device with an Internet connection;A current web browser that includes 128-bit encryption (e.g. Internet Explorer version 9.0 and above, Firefox version 3.6 and above, Chrome version 31.0 and above, or Safari 7.0 and above) with cookies enabled;A valid email address (your primary email address on file with Coinbase); andSufficient storage space to save past Communications or an installed printer to print them. \n\nHow to Withdraw Your Consent\n\nYou may withdraw your consent to receive Communications electronically by e-mailing us at support@coinbase.com. If you fail to provide or if you withdraw your consent to receive Communications electronically, Coinbase reserves the right to immediately close your Account or charge you additional fees for paper copies.\n\nUpdating your Information\n\nIt is your responsibility to provide us with a true, accurate and complete e-mail address and your contact information, and to keep such information up to date. You understand and agree that if Coinbase sends you an electronic Communication but you do not receive it because your primary email address on file is incorrect, out of date, blocked by your service provider, or you are otherwise unable to receive electronic Communications, Coinbase will be deemed to have provided the Communication to you.\n\nYou may update your information by logging into your account and visiting settings or by contacting our support team via e-mail at support@coinbase.com\n\nAPPENDIX 4: STATE LICENSE DISCLOSURES\n\nCoinbase maintains licenses to engage in money transmission activities in many states, and these licenses may impact our provision and your use of certain Coinbase Services depending on where you live. Coinbase's licenses and corresponding required disclosures can be found on the Coinbase Licenses page, which is incorporated by reference.\n\nIf you live in the following jurisdictions, we are required to provide you with the following information:\n\nAlaska Please note that this license does not cover the transmission of virtual currency. If you have a complaint or other concern about Alaska money services licensees, authorized delegates, and the money services provided by money services licensees and authorized delegates, you may contact the Alaska Department of Commerce, Community, and Economic Development, Division of Banking and Securities at (907) 465-2521.\n\nFlorida If you have a question or complaint, please contact the consumer assistance division of Coinbase at support@coinbase.com or 1-800-343-5845.\n\nNOTICE by the Florida Office of Financial Regulation: BY GRANTING COINBASE A LICENSE, THE FLORIDA OFFICE OF FINANCIAL REGULATION IS NOT ENDORSING THE USE OF DIGITAL OR VIRTUAL CURRENCIES.\n\nU.S. currency is legal tender backed by the U.S. government.Digital and virtual currencies are not issued or backed by the U.S. government, or related in any way to U.S. currency, and have fewer regulatory protections.The value of digital and virtual currencies is derived from supply and demand in the global marketplace which can rise or fall independently of any fiat (government) currency.Holding digital and virtual currencies carries exchange rate and other types of risk. \n\nPOTENTIAL USERS OF DIGITAL OR VIRTUAL CURRENCIES, INCLUDING BUT NOT LIMITED TO BITCOIN, SHOULD BE FOREWARNED OF A POSSIBLE FINANCIAL LOSS AT THE TIME THAT SUCH CURRENCIES ARE EXCHANGED FOR FIAT CURRENCY DUE TO AN UNFAVORABLE EXCHANGE RATE. A FAVORABLE EXCHANGE RATE AT THE TIME OF EXCHANGE CAN RESULT IN A TAX LIABILITY. PLEASE CONSULT YOUR TAX ADVISOR REGARDING ANY TAX CONSEQUENCES ASSOCIATED WITH YOUR HOLDING OR USE OF DIGITAL OR VIRTUAL CURRENCIES.\n\nLouisiana Coinbase is licensed by the Louisiana Office of Financial Institutions as a money transmitter. The Louisiana Office of Financial Institutions does not license or regulate services related to virtual currency, including but not limited to transmission or exchange which may be conducted by Coinbase.\n\nMaryland The Commissioner of Financial Regulation for the State of Maryland will accept all questions or complaints from Maryland residents regarding Coinbase by contacting the Commissioner's office at: 500 North Calvert Street, Suite 402, Baltimore, Maryland 21202, or (888) 784-0136.\n\nNew York Coinbase holds licenses issued by the New York State Department of Financial Services (\"NYDFS\") to engage in money transmission and virtual currency business activity, respectively. If you have a complaint, please contact support@coinbase.com or 1-800-343-5845. New York consumers may also direct unresolved complaints directly to NYDFS at the NYDFS Consumer Complaint Portal or by contacting the NYDFS as follows: NYDFS Consumer Assistance Unit, One Commerce Plaza, Albany, NY 12257, 1-800-342-3736. \n\nPlease note the following disclosures associated with virtual currency:\n\nVirtual currency is not legal tender, is not backed by the government, and accounts and value balances are not subject to Federal Deposit Insurance Corporation or Securities Investor Protection Corporation protections.Legislative and regulatory changes or actions at the state, federal, or international level may adversely affect the use, transfer, exchange, and value of virtual currency.Transactions in virtual currency may be irreversible, and, accordingly, losses due to fraudulent or accidental transactions may not be recoverable.Some virtual currency transactions shall be deemed to be made when recorded on a public ledger, which is not necessarily the date or time that the customer initiates the transaction.The value of virtual currency may be derived from the continued willingness of market participants to exchange fiat currency for virtual currency, which may result in the potential for permanent and total loss of value of a particular virtual currency should the market for that virtual currency disappear.There is no assurance that a person who accepts a virtual currency as payment today will continue to do so in the future.The volatility and unpredictability of the price of virtual currency relative to fiat currency may result in significant loss over a short period of time.The nature of virtual vurrency may lead to an increased risk of fraud or cyber attack.The nature of virtual currency means that any technological difficulties experienced by Coinbase may prevent the access or use of a customer’s virtual currency.Any bond or trust account maintained by Coinbase for the benefit of its customers may not be sufficient to cover all losses incurred by customers. \n\nTexas If you have a complaint, please contact the consumer assistance division of Coinbase at support@coinbase.com or 1-800-343-5845. If you still have an unresolved complaint regarding Coinbase's money transmission activity, please direct your complaint to: Texas Department of Banking, 2601 North Lamar Boulevard, Austin, Texas 78705, 1-877-276-5554 (toll free), or www.dob.texas.gov.\n\nTennessee Please note that Coinbase's Tennessee license and the required surety bond do not cover the transmission of virtual currency. Coinbase is licensed by the Tennessee Department of Financial Institutions as a money transmitter. The Tennessee Department of Financial Institutions does not regulate virtual currency.\n\nVirginia Coinbase is licensed by the Virginia State Corporation Commission as a money transmitter, but such license does not cover the transmission of virtual currency (Bitcoin).\n\nPART 2. ADDITIONAL TERMS FOR MERCHANTS\n\n1. Merchant Services.\n\n1.1. Merchant Services. Users who intend to sell goods and/or services (each, a \"Merchant\") and who wish to accept Digital Currency from purchasers as a method of payment may use a suite of tools and related services for this purpose (the \"Merchant Services\"). Through the Merchant Services, Coinbase enables Merchants to accept Digital Currency from customers as a method of payment, and processes the transfer of Digital Currency to Merchants from their customers. Merchants may also sell Digital Currency to, or buy Digital Currency from, Coinbase, and otherwise utilize the Coinbase Services, in the same manner as any other user. Use of Merchant Services is subject to this Part 2 and is also subject to General Use terms, including without limitation the releases, indemnities, disclaimers, limitations of liability, prohibited use, dispute resolution, and cancellation policies set forth above.\n\n1.2. Merchant Profile. Each Merchant user is required to provide accurate information necessary to complete a merchant profile associated with the user's Coinbase Account. This information may include business name, address and other contact information, website URL, taxpayer or other government ID, corporate documents, and other information Coinbase may request. Coinbase may limit Merchant transaction volumes depending on (i) the Merchant's historical activity on Coinbase, (ii) satisfactory completion of a Merchant profile; (iii) satisfaction of reasonable requests for additional information; (iv) perceived risks; (v) repeated customer complaints; and/or (vi) any indication that the Merchant has violated this Agreement. Newly on-boarded Merchants may be required to submit to additional verification procedures as necessary to verify that the Merchant operates a legitimate business.\n\n2. Merchant Transactions and Settlement.\n\n2.1. Transaction Confirmation. Coinbase will provide users of Merchant Services with an order notification indicating when or whether the Merchant has been paid by its customer.\n\n2.2. Completed Order Notifications. Upon Merchant's customer's submission of a valid and completed payment through Merchant Services, Coinbase will send a callback to Merchant's designated callback URL to confirm successful transfer of the customer's payment to Merchant—so designated as a \"completed\" order. Except on suspicion of fraud, error, or abusive use, Coinbase will not reverse a payment and/or corresponding Digital Currency credit which it has designated as completed.\n\n2.3. Timing of Completed Order. If the Merchant's customer uses a Hosted Digital Currency Wallet to successfully initiate its purchase, Coinbase will issue the completed callback order immediately to the Merchant. If the Merchant's customer does not use a Hosted Digital Currency Wallet to effect its purchase, Coinbase will initiate an order status callback when Coinbase detects that the corresponding Digital Currency transaction has been confirmed by the corresponding Digital Currency network.\n\n2.4. Mispaid Order Notifications. A callback may also indicate an order status as \"mispaid,\" meaning Coinbase has detected transfer of an amount of Digital Currency which does not correspond with the Digital Currency Price and/or that the customer transferred Digital Currency after expiration of a checkout window. \"Mispaid\" orders may result in transfer of Digital Currency to Merchant's Coinbase Wallet for further processing by Merchant in accordance with Merchant's refund and order processing policies, but shall not be deemed completed by Coinbase.\n\n2.5. Limitations. Coinbase may delay order verifications if Merchant has not provided its legal name, logo, website, phone number, address, taxpayer identification number, designation of business location and type. Until completion of such applicable verification procedures, newly-boarded Merchants may experience delayed processing of Digital Currency Transactions or Conversion Service transactions. Coinbase will designate any such delayed transaction as \"pending,\" and funds will not be available in the Merchant's Coinbase Account and/or Currency Account until the pending transaction is completed. Coinbase reserves the right to refuse to process, cancel, or to reverse any Merchant transaction (i) as required by law, (ii) in response to a facially valid subpoena, court order, or other government order, or (iii) if Coinbase reasonably suspects that the transaction is erroneous, or related to Prohibited Use or Prohibited Business as defined in the User Agreement.\n\n2.6. Instant Conversion. Merchants who have successfully linked a payout method to their Coinbase Account may use the Instant Conversion Service. The Instant Conversion Service will allow Merchants to designate the price of their goods and services in local currency (e.g., USD) and customers to pay for their purchases from such Merchant in Digital Currency based on the Sell Price Conversion Rate quoted by Coinbase on the Coinbase Site and displayed to the customer at the time that the customer approves the purchase. In connection with the Instant Conversion Service, the Merchant, as merchant of record for each transaction, shall: (i) use Coinbase to calculate an appropriate amount of Digital Currency (a \"Digital Currency Price\") to be transferred to Merchant as payment for a good or service with reference to the Sell Price Conversion Rate at the time Merchant's customer visits the Merchant's checkout page; Coinbase will lock the Digital Currency Price for a period of time, but if the customer does not initiate a transfer within a certain payment window, Coinbase will recalculate the Digital Currency Price based on an updated Sell Price Conversion Rate; (ii) accept Digital Currency into its corresponding Hosted Digital Currency Wallet; (iii) immediately sell such Digital Currency to Coinbase using the Instant Conversion Service, and (iv) subsequently receive the proceeds from such Digital Currency sale transaction from Coinbase in the relevant local currency in an amount equal to the original USD price of the item, less applicable fees. By using this service, Coinbase guarantees that regardless of any change in the price of Digital Currency between the time of purchase and settlement, the Merchant will receive the fixed purchase price as designated by the Merchant in local currency at the time the customer approved the purchase, less applicable fees.\n\n2.7. Settlement. Settlements to Merchant in connection with the Merchant's sale of Digital Currency to Coinbase will generally take a minimum of two to three business days, following Coinbase's transmission to Merchant of confirmation of the relevant transaction, although exceptions may apply.\n\n3. Release, Restrictions, and General Use.\n\n3.1 Merchant Transactions. Each Merchant acknowledges and agrees that Coinbase has no control over, or liability for, the delivery, quality, safety, legality or any other aspect of any goods or services that the Merchant may sell to customers using the Coinbase Services. Each Merchant is responsible for handling customer inquiries related to the goods and/or services it sells to customers through the Coinbase Services, except for inquiries related to payment for such goods or services which will be handled by Coinbase. Each Merchant warrants that it will not use any Coinbase Services in connection with any Prohibited Use or Business, as described herein. Each Merchant confirms that by opening a Coinbase Account, the Merchant will not use the Coinbase Services to accept payments in connection with any of the Prohibited Businesses. Each Merchant further warrants that it will not use Coinbase Services in connection with transactions which involve pre-payment of an order which the Merchant does not intend to fulfill within thirty (30) days. When a Merchant must issue a refund to a customer, Coinbase will debit the Merchant's Hosted Digital Currency Wallet for the relevant amount of Digital Currency (or, in the event the Merchant uses the Instant Conversion Service, the Merchant shall purchase the relevant amount of Digital Currency in local currency before Digital Currency is debited from the Merchant's Hosted Digital Currency Wallet) and provide a refund to the customer in Digital Currency having a value equal to the transaction amount being refunded, as expressed in local currency (e.g., USD), based on the then current Conversion Rate.\n\n3.2. Obligations of Merchants. In addition to the obligations set forth elsewhere in this Agreement, Merchants agree to:\n\n(1) At all times maintain all licenses, registrations, authorizations and approvals required to operate their business, conduct all activities related thereto, and utilize the Coinbase Services in connection therewith.\n\n(2) Ensure that all aspects of their business, including (i) all Merchant activities, and the activity of any third party engaged by the Merchant, (ii) the goods and services offered for sale by Merchant, and (iii) the acts or omissions of each Merchant in connection with their use of Coinbase Services comply with applicable law at all times.\n\n(3) Promptly provide, and cause third parties under its control to promptly provide, such information as Coinbase may request from time to time regarding (i) the Merchant, its policies, procedures, and activities, (ii) any good or service offered for sale and for which the Merchant may accept payment by use of Coinbase Services, or (iii) any transaction conducted through the use of Coinbase Services, to the extent Coinbase deems such information reasonably necessary to comply with its policies or procedures, applicable law, an audit, or the guidance or direction of, or request from, any regulatory authority or financial institution.\n\n(4) Within the Coinbase-hosted payment page, accurately identity the sale item in the Item Name field and provide an accurate and succinct description of the same sale item in the Item Description Field.\n\n(5) Authorize Coinbase to, directly or through third parties, (i) make any inquiries we consider necessary to verify your identity and/or account information, and (ii) request and obtain any consumer report, credit report or similar information relating to you and to take action we reasonably deem necessary based on the results of such inquiries and reports, and hereby authorize any and all third parties to which such inquiries or requests may be directed to fully respond to such inquiries or requests.\n\nPART 3. GDAX\n\n1. GDAX Accounts.\n\n1.1 Access to GDAX Authorized users may establish an account at GDAX (at www.gdax.com), an order book exchange platform for Digital Currencies. Coinbase does not offer GDAX to customers in all jurisdictions. This Part 3 of the User Agreement applies to you if you access and use GDAX.\n\n1.2 Order Books. GDAX offers an order book for various Digital Currency and local currency trading pairs (each an 'Order Book'). Refer to your GDAX account to determine which Order Books are available to you.\n\n1.3 Your GDAX Account. Your GDAX Account consists of the following.\n\nA dedicated Hosted Digital Currency Wallet for each Digital Currency offered on GDAX (each a \"GDAX HDC Wallet\").\n\nA dedicated USD Wallet (a \"GDAX USD Wallet\").\n\nAssociated user tools, accessible at www.gdax.com and through GDAX API.\n\n1.4 Deposits. You may fund your GDAX Account by depositing digital and/or local currency from your basic Coinbase Account, Bank Account or an external Digital Currency address into your GDAX Account. Funds in your GDAX Account can be used only to trade on GDAX.\n\n1.5 Withdrawals. You may withdraw Digital Currency from your GDAX Account by transfer to your basic Coinbase Account or to an external Digital Currency address. You may withdraw US Dollars from your GDAX Account to your basic Coinbase Account or directly to your Bank Account.\n\nALL DEPOSITS, WITHDRAWALS, ORDERS AND TRADING MAY BE SUBJECT TO LIMITS. ALL LIMITS WILL BE DISPLAYED IN YOUR GDAX ACCOUNT.\n\n2. Orders, Trades, and Fees.\n\n2.1 Orders and Trades. Your GDAX Account allows you to place an order to buy or sell a specified quantity of a Digital Currency at a specified price in a local currency or other Digital Currency (\"Order\"). You must have a sufficient balance in your GDAX Account to cover the total value of the Order plus any applicable fees.\n\nYour valid Orders will be immediately placed on the relevant Order Book, and will be eligible to be matched with corresponding Order(s) placed by other GDAX users, at the relevant price and on a first-in-time priority basis.\n\nWhen an Order is matched, in part or in full, to one or more corresponding Orders, one or more trades (\"Trades\") are executed (also referred to as 'Fills'). Coinbase immediately settles each Trade by transferring funds between the trading counterparties' GDAX Accounts.\n\n2.2 Takers. If your Order is immediately matched with one or more corresponding Orders, you are a \"Taker\" and the Order will result in a Trade at the price of the preexisting Order in the Order Book. Takers are charged a fee (described below), which is automatically debited from the Taker's GDAX Account in the relevant quote currency.\n\nOrders placed as 'market' Orders or 'stop' Orders are Taker Orders. In addition, it is possible for 'limit' Orders to be Taker Orders, unless 'post-only' is selected. More information about the different Order types is available at https://docs.gdax.com/.\n\n2.3. Makers. If your Order is not immediately matched with a corresponding Orders, you are a \"Maker\" and your Order will remain open in the relevant Order Book until either (i) the Order is cancelled, or (ii) the Order is matched to a corresponding Order and a Trade is executed.\n\nCoinbase hold funds in your GDAX Account for any open Order. You can release the hold by canceling the Order without charge. When a corresponding Order is placed in the Order Book, the Maker's open Order will result in an executed Trade at the price the Maker posted to the Order Book. No fee is charged for Maker Orders.\n\n2.4. Partial Order Execution. Your Order may be executed in parts depending on the availability of corresponding Orders on GDAX. The Trade resulting from an immediate, partial execution is subject to Taker commissions as described above. Any unfulfilled remainder will remain as an open, Maker Order in the Order Book until it is either cancelled or matched to a corresponding Order.\n\n2.5. Taker Price Improvement. Taker Orders are matched against existing Maker Orders at the price of the Maker Order posted in the Order Book, not at the price of the Taker Order. Coinbase will automatically match a Taker Order to any open Order whose price is at least as favorable as the Taker's Order price, if not more favorable to the Taker. Maker Orders will always be executed at the posted Order Book price.\n\n2.6. Self-Trade Prevention. Coinbase will prevent you from entering Orders which would result in self-execution—i.e., where you act as both Maker and Taker to a Trade. In the event that any open or partially open Order would result in self-execution, Coinbase will automatically cancel the smaller quantity open Order, decrement the larger quantity Order in an amount equivalent to the cancelled quantity, and allow the remainder of the larger Order to remain open. If two such Orders are the same quantity, both will be cancelled.\n\n2.7. Alternative Order Instructions. GDAX may allow you to input alternative Order parameters which differ from the default parameters set forth above. Alternative Order parameters, such as those preventing partial Order execution and/or which affect the timing of your Trades, are described at: https://docs.gdax.com/.\n\n2.8. Trading Fees. Maker Orders are not charged a fee. Taker Orders are charged a fee as a percentage of the Trade value, expressed in the relevant quote currency. The current fees are posted at: https://gdax.com/fees.\n\nBy placing an Order on a GDAX Order Book, you agree to pay all applicable fees and you authorize Coinbase to automatically deduct fees directly from your GDAX Account.\n\n2.9 Withdrawal Fees. Coinbase may also charge a fee on certain US Dollar deposit or withdrawal methods (e.g. Wire Deposit). All such fees will be clearly displayed in your GDAX Account.\n\n3. General Use, Restrictions, and Cancellation.\n\n3.1. Trading Account Use. By using a GDAX Account you agree and represent that you will place Orders only for yourself as Account owner, and not on behalf of any third party, unless you have obtained prior approval from Coinbase. You may not sell, lease, furnish or otherwise permit or provide access to your Trading Account to any other entity or to any individual that is not your employee or agent. You accept full responsibility for your employees' or agents' use of GDAX, whether such use is directly through GDAX website or by other means, such as those facilitated through API keys, and/or applications which you may authorize. You understand and agree that you are responsible for any and all orders, trades, and other instructions entered into GDAX including identifiers, permissions, passwords, and security codes associated with your GDAX Account.\n\n3.2. Suspension and Cancellation. We may suspend your GDAX Account in accordance with the User Agreement Account suspension and termination provisions. Suspension or termination of your GDAX Account shall not affect the payment of fees or other amounts you owe to Coinbase. In the event that your Basic Coinbase Account is suspended or terminated, we will immediately cancel all open Orders associated with your GDAX Account, block all withdrawals and bar the placing of further Orders until resolution or Account cancellation.\n\n3.3. No Warranty. We do not represent that GDAX and/or its constituent GDAX Accounts, APIs, and related services, will be available without interruption. Although we will strive to provide you with continuous operations, we do not guarantee continuous access or that there will be no delays, failures, errors, omissions or loss of transmitted information, nor do we guarantee that any Order will be executed, accepted, recorded, or remain open. In the event of a significant system outage, Coinbase reserves the right to cancel any open trades and/or suspend GDAX activity indefinitely.\n\n3.4. No Investment Advice or Brokerage. For the avoidance of doubt, Coinbase does not provide investment, tax, or legal advice, nor does Coinbase broker trades on your behalf. All GDAX trades are executed automatically, based on the parameters of your Order instructions and in accordance with posted Trade execution procedures, and you are solely responsible for determining whether any investment, investment strategy or related transaction is appropriate for you based on your personal investment objectives, financial circumstances and risk tolerance. You should consult your legal or tax professional regarding your specific situation.\n\n3.5. Trade Cancellation. Except as otherwise set forth herein, all trades are final and commissions and/or fees paid to Coinbase are non-refundable. Coinbase reserves the right to cancel Orders and/or reverse Trades in the following circumstances.\n\nOrders or Trades which, in our sole discretion, constitute an abusive use of the platform, for example, market manipulation.\n\nOrders or Trades which under the circumstances involve an obvious error with respect to price, quantity, or other parameters (\"Clearly Erroneous Transaction\").\n\nIf required by any applicable law or regulation, including specifically where we are required to suspend or terminate your Coinbase Account or GDAX Account because you have not complied with our Verification Procedures.\n\nTo restrict trade size or frequency or limit API use which, in our sole discretion, unreasonably burdens the platform.\n\nWe will act under this section only in good faith, and to notify you as soon as possible. You hereby release us from all liability in relation to any action taken by us under this section.\n\n3.6. Debts. In the event that there are outstanding amounts owed to us hereunder, including in your Coinbase Account, Coinbase reserves the right to debit your GDAX Account accordingly and/or to withhold amounts from funds you may transfer from your GDAX Account to your Coinbase Account.\n\nPART 4. ADDITIONAL TERMS FOR DEVELOPERS\n\n1. Developer's Tools License.\n\n1.1. Developer's Tools. This Agreement governs your use of any and all development applications provided by Coinbase, including, but not limited to Coinbase's application programming interface and any accompanying or related documentation, source code, executable applications and other materials (the \"Coinbase API\"), the Coinbase Sandbox, available at https://sandbox.coinbase.com/, and any other resources or services available at https://developers.coinbase.com/ (\"Coinbase Services\") provided to you pursuant to this Agreement (collectively, the \"Developer's Tools\"). Use of the Developer's Tools is subject to this Part 4 and is also subject to General Use terms, including without limitation the releases, indemnities, disclaimers, limitations of liability, prohibited use, dispute resolution, and cancellation policies set forth above.\n\n1.2. License Grant. Subject to the terms and restrictions set forth in this Agreement, Coinbase grants you a limited, revocable, non-exclusive, non-transferrable and non-sublicensable license solely to use and integrate the Developer's Tools and underlying content into your website or application (your \"Application\") so that your Application can interface directly with Coinbase devices, applications, or services.\n\n1.3. Restrictions and Responsibilities. By using the Developer's Tools, you agree to the following terms:\n\n1.3.1. You shall:\n\n(1) Register for a Coinbase Account.\n\n(2) Comply with the terms of this Agreement and the Privacy Policy incorporated herein by reference, and which may be amended from time to time (the \"Terms\"). If you continue to use the Developer's Tools and Coinbase Marks after any such amendment, you will be deemed to have accepted any modifications. \n\n(3) Comply with all applicable laws, regulations, licensing requirements, and third party rights (including, without limitation, data privacy laws).\n\n(4) Represent and warrant that your Application, including but not limited to the name of the Application and all content in your Application, does not infringe the Intellectual Property rights of Coinbase or any third party.\n\n(5) Disclose in your Application, through a privacy policy or otherwise, how you collect, use, store, and disclose data collected from end users, as described in Section 6.2 of this Part 4.\n\n(6) Use the Coinbase Marks only as expressly authorized in this Agreement.\n\n(7) Obtain prior written approval from Coinbase prior to releasing any statements, written media releases, public announcements and public disclosures, including promotional or marketing materials, relating to Coinbase, the Coinbase Marks, or this Agreement.\n\n(8) Comply with additional verification procedures in the event that your Application seeks OAuth permissions to transfer Digital Currency in an amount greater than predefined limits.\n\n(9) Take steps to adequately secure your API Keys and OAuth Tokens, including the measures specified at https://developers.coinbase.com/docs/wallet/api-key-authentication and https://developers.coinbase.com/docs/wallet/coinbase-connect/security-best-practices\n\n1.3.2. You shall not:\n\n(1) Copy, rent, lease, sell, sublicense, or otherwise transfer your rights in the Developer's Tools to a third party.\n\n(2) Alter, reproduce, adapt, distribute, display, publish, reverse engineer, translate, disassemble, decompile or otherwise attempt to create any source code that is derived from the Developer's Tools.\n\n(3) Cache, aggregate, or store data or content accessed via the Developer's Tools other than for purposes allowed under this Agreement.\n\n(4) Use the Developer's Tools for any Application that constitutes, promotes or is used in connection with spyware, adware, or any other malicious programs or code.\n\n(5) Use the Developer's Tools to encourage, promote, or participate in illegal activity, violate third party rights, including intellectual property rights or privacy rights, or engage in any Prohibited Use or Prohibited Business as defined in the Terms.\n\n(6) Use the Developer's Tools in a manner that exceeds reasonable request volume, constitutes excessive or abusive usage, or otherwise impacts the stability of Coinbase's servers or impacts the behavior of other applications using the Developer's Tools.\n\n(7) Display Developer's Tools or Coinbase Marks in a manner that could reasonably imply an endorsement, relationship or affiliation with or sponsorship between you or a third party and Coinbase, other than as expressly permitted in writing by Coinbase.\n\n(8) Attempt to cloak or conceal your identity or your Application's identity when requesting authorization to the Developer's Tools.\n\n1.3.3 Indemnification\n\nTo the maximum extent permitted by law, you agree to defend, indemnify and hold harmless Coinbase, its affiliates and their respective directors, officers, employees and agents from and against any and all third party claims, actions, suits or proceedings, as well as any and all losses, liabilities, damages, costs and expenses (including reasonable attorney’s fees) arising out of or accruing from (a) your use of the Coinbase API or your Coinbase Account in violation of this Agreement, (b) your Application that infringes any copyright, trademark, trade secret, trade dress, patent or other intellectual property right of any person or defames any person or violates their rights of publicity or privacy, or (c) your failure to secure and keep secret your OAuth Token(s) or API key(s).\n\n2. Activities Subject to Additional Restrictions.\n\n2.1. Activities Subject to Additional Restrictions. Coinbase may require you to obtain written consent and complete enhanced on-boarding procedures, and/or may restrict your Application if you would like to create/offer an Application which is designed for or results in any of the following:\n\n2.1.1. Provide International Remittance Services. Any Application which involves a service that provides for: (i) an international (cross border) transfer of funds from a Sender to a Recipient, (ii) without an underlying sale or other bona fide commercial purpose for the transfer.\n\n2.1.2. Provide Banking or Other Licensed Financial Services. Any Application which either holds money for eventual payment or which offers or provides credit, either directly or as a broker or arranger between third parties, or any Application that would require licensing as a bank, money services business, or other financial service provider, or as an escrow service in the jurisdiction where the service's users reside, unless such Application falls within the definition of a Prohibited Business under the Terms.\n\n2.1.3. Provide Gaming Services. Any Application which involves the payment of funds by a customer in exchange for the chance to earn or win a prize, reward, or other payment.\n\n2.1.4. Provide Digital Currency Exchange Services. Any Application which involves a business engaged in the exchange of Digital Currency for local currency, funds, or other Digital Currency and which accepts and transmits a convertible Digital Currency or buys or sells convertible Digital Currency for any reason.\n\n2.1.5 Provide Donation Acceptance Services. Any Application which involves a service which allows for the acceptance of donations on behalf of a charity or other religious or spiritual organization.\n\n3. Intellectual Property and Ownership; Use of Marks.\n\nAs between Coinbase and you, the Developer's Tools, Coinbase Marks, and all intellectual property rights therein and thereto are and shall at all times remain the sole and exclusive property of Coinbase and are protected by applicable intellectual property laws and treaties. You have no rights with respect to Developer's Tools or Coinbase Marks except as expressly set forth herein. If you obtain Coinbase's prior written consent, you may use and display Coinbase's name and logo (\"Coinbase Marks\") solely to attribute the Developer's Tools as the source of your Application.\n\n4. API Calls and Compliance\n\nCoinbase may set limits on the number of API calls that you can make at its sole discretion, for example in the interest of service stability. If you exceed these limits, Coinbase may moderate your activity or cease offering you access to the Coinbase APIs altogether in Coinbase's sole discretion. You agree to such limitations and will not attempt to circumvent such limitations. Coinbase may immediately suspend or terminate your access to the Developer's Tools without notice if Coinbase believes, in its sole discretion, that you are in violation of this Agreement or the Terms.\n\n5. Updates and Support\n\nCoinbase may elect to provide you with support or modifications for the Developer's Tools, in its sole discretion, and may terminate such support at any time without notice. Coinbase may change, suspend, or discontinue any aspect of the Developer's Tools at any time, including the availability of any Developer's Tools.\n\n6. Security and Privacy\n\n6.1 Security. You will use all reasonable efforts to protect Customer Data (as defined below) collected by your Application, including without limitation any personally identifiable information (\"PII\"), from unauthorized access or use. In the event your systems or infrastructure that are used for storage, processing or hosting Customer Data are breached or compromised, or if Customer Data is inadvertently exposed to non-authorized third parties, you shall notify Coinbase promptly of such a breach or exposure including root cause, remediation steps, and compensating controls to ensure such a breach does not occur in the future. You are responsible for providing customer notification under the state breach notification statutes and any other applicable privacy laws and you will bear the costs incurred by Coinbase resulting from your breach or exposure. You acknowledge that you are solely responsible for any personal injury or property damage arising from or relating to your use of any Developer's Tools or any authorized or unauthorized use of your Application.\n\n6.2. Privacy and PII. \"Customer Data\" means any and all technical information, PII, device usage information, or other information derived from access to or use of any of the Developer's Tools, including but not limited to data that relates to any end users of any Coinbase products or services or pertains to use of any Coinbase products or services by such end users. You acknowledge and agree that you are solely responsible for obtaining all required consents from end users in connection with any use of your Application and the Developer's Tools, which consent shall be compliant with all applicable data protection legislation and other privacy laws, rules, and regulations. Without limiting the foregoing, before collecting any Customer Data or other information from end users of your Application, you must provide adequate notice of what Customer Data and other information you collect and how it will be used and/or shared and obtain any necessary consents. You and your Application will comply with all privacy laws and regulations (including those applying to PII) in connection with your access and use of the Developer's Tools. You will provide and adhere to a privacy policy for your Application that: (i) complies with all applicable laws, rules, and regulations, (ii) is conspicuously displayed to all end users of your Application, and (iii) clearly and accurately describes to end users of your Application what data and user information you collect (such as PII, login information, etc.) and how you use and share such information (including for advertising) with Coinbase and third parties. If a user requests of you or Coinbase to have any Customer Data that may be considered PII under any law, rule, or regulation throughout the world deleted, you agree to promptly honor the user's or Coinbase's request and to delete all such data and information from your servers and other assets, including back-ups, to the extent reasonably possible, or to anonymize all user data so it cannot be tied back to a user's identity.\n\n6.3. Data Use. You will not sell any Customer Data or disclose any Customer Data to any third party. Your Application may use Customer Data only as required for use and access to your Application by the end user to whom such Customer Data relates. You shall not sublicense the Customer Data to any third party, and you shall not use or disclose any information derived directly or indirectly from the Customer Data for any purpose other than as set forth above. Without limiting the generality of the foregoing, you shall not use any part of the Customer Data to create a database separate from your Application or transmit all or part of the Customer Data to any third party for any use separate from your Application. Any use of Customer Data other than as expressly permitted by this Agreement is strictly prohibited.\n\n",
      "resource-id": "com.coinbase.android:id/signup_tnc_description",
      "ancestors": [
        "android.widget.TextView",
        "android.view.View",
        "java.lang.Object"
      ],
      "clickable": true,
      "class": "android.support.v7.widget.AppCompatTextView",
      "bounds": [
        126,
        776,
        1314,
        2112
      ],
      "componentLabel": "Text"
    },
    {
      "text": "CANCEL",
      "resource-id": "com.coinbase.android:id/signup_tnc_cancel",
      "ancestors": [
        "android.widget.TextView",
        "android.view.View",
        "java.lang.Object"
      ],
      "clickable": true,
      "class": "android.support.v7.widget.AppCompatTextView",
      "bounds": [
        70,
        2144,
        718,
        2322
      ],
      "componentLabel": "Text Button",
      "textButtonClass": "back"
    },
    {
      "text": "I AGREE",
      "resource-id": "com.coinbase.android:id/signup_tnc_agree",
      "ancestors": [
        "android.widget.TextView",
        "android.view.View",
        "java.lang.Object"
      ],
      "clickable": true,
      "class": "android.support.v7.widget.AppCompatTextView",
      "bounds": [
        722,
        2144,
        1370,
        2322
      ],
      "componentLabel": "Text Button",
      "textButtonClass": "agree"
    }
  ]
}