{
  "ancestors": [
    "android.widget.FrameLayout",
    "android.view.ViewGroup",
    "android.view.View",
    "java.lang.Object"
  ],
  "class": "com.android.internal.policy.PhoneWindow$DecorView",
  "bounds": [
    0,
    0,
    1440,
    2560
  ],
  "clickable": false,
  "children": [
    {
      "resource-id": "com.tmobile.tuesdays:id/toolbar",
      "children": [
        {
          "ancestors": [
            "android.widget.ImageView",
            "android.view.View",
            "java.lang.Object"
          ],
          "resource-id": "com.tmobile.tuesdays:id/imageViewBack",
          "clickable": true,
          "class": "com.tmobile.tuesdays.components.imageview.KyobiImageView",
          "bounds": [
            22,
            77,
            190,
            245
          ],
          "componentLabel": "Image"
        },
        {
          "ancestors": [
            "android.widget.ImageView",
            "android.view.View",
            "java.lang.Object"
          ],
          "resource-id": "com.tmobile.tuesdays:id/imageViewTmobile",
          "clickable": true,
          "class": "android.support.v7.widget.AppCompatImageView",
          "bounds": [
            544,
            73,
            953,
            250
          ],
          "componentLabel": "Image"
        }
      ],
      "ancestors": [
        "android.view.ViewGroup",
        "android.view.View",
        "java.lang.Object"
      ],
      "clickable": false,
      "class": "android.support.v7.widget.Toolbar",
      "bounds": [
        0,
        64,
        1419,
        260
      ],
      "componentLabel": "Toolbar"
    },
    {
      "text": "OFFICIAL RULES",
      "resource-id": "com.tmobile.tuesdays:id/textTitle",
      "ancestors": [
        "android.widget.TextView",
        "android.view.View",
        "java.lang.Object"
      ],
      "clickable": false,
      "class": "com.tmobile.tuesdays.components.textview.CustomFontTextView",
      "bounds": [
        0,
        284,
        1440,
        441
      ],
      "componentLabel": "Text"
    },
    {
      "text": "NO PURCHASE NECESSARY TO ENTER OR WIN. MAKING A PURCHASE WILL NOT IMPROVE YOUR CHANCES OF WINNING. YOU DO NOT NEED THE T-MOBILE TUESDAYS APP TO PARTICIPATE. VOID WHERE PROHIBITED BY LAW.\n\n1. OVERVIEW: This T-Mobile Tuesdays Week #30 Game (the “Game”) begins at 5:00:00 a.m. Eastern Time (“ET”) on Tuesday, December 27, 2016, and ends at 4:59:59 a.m. ET on Wednesday, December 28, 2016 (“Promotion Day”). This Game is associated with a larger promotional campaign that Sponsor (defined below) operates via its T-Mobile Tuesdays App (“App”). These Official Rules apply only to the individual Game identified above and not any of the other activities offered via the App, including the T-Mobile customer exclusive offers available in the App (“Customer Exclusive(s)”). Customer Exclusives and other promotional activities are separate from the Game and will be subject to their own terms and conditions. By participating in the Game, you are agreeing to be bound by the decisions of Sponsor (defined below), which are final and binding with respect to all aspects of the Game. If you play the Game via the App or the Game Site, the end of your Game experience may include a Game animation; however, winning the Game is determined solely based on the time at which you clicked the Play Now button within the App, Game Site or AMOE Page (each term defined below) and not on the outcome of any Game animation. Game animations are purely for entertainment purposes.\n\n2. ELIGIBILITY: The Game is open to legal residents of any one (1) of the fifty (50) United States, District of Columbia or Puerto Rico (collectively, the “Territory”), who are at least thirteen (13) years of age at the time of participation (each an eligible “Participant”). Employees, officers, directors, agents and representatives of T-Mobile USA, Inc., the prize partner Lyft, Inc. (a “Prize Partner”), their respective parent companies, affiliates or subsidiaries, and any other party participating in the development, design, administration or fulfillment of this Game (all of the foregoing entities and individuals, together, “Released Parties”), and the immediate family members of any such individual (spouse, IRS-dependent, biological, foster, in-law, adoptive or step- mother, father, sister, brother, child, husband or wife, and their respective spouses, regardless of where they reside), and those living in the same household of any such individuals, whether or not related, are not eligible. This Game is void where restricted or prohibited by law.\n\nTo Be Eligible To Win: Winning any prize requires that the potential winner of the prize is, and remains, in compliance with these Official Rules. Until a potential winner is verified to be eligible and in compliance with these Official Rules, the potential winner is, and will remain, a potential prize winner, unless the potential winner is disqualified for not complying with the Official Rules, including for playing via more than one method (App, Game Site and/or AMOE Page (both terms defined below)) and/or not being eligible to participate in the Game. Sponsor reserves the right in its sole discretion to disqualify any potential winner who Sponsor determines is not permitted by law to receive a prize. Sponsor reserves the right to refrain from conducting any advertising or publicity associated with a winner for any reason. Corporations and companies (any type) cannot be winners in this Game and are not entitled to any prizing won by their employees. Only natural people can be winners in this Game.\n\n3. HOW TO ENTER: During the Promotion Day, eligible Participants can use the T-Mobile Tuesdays App (the “App”), visit the T-Mobile Tuesdays website (www.T-MobileTuesdays.com) (“Game Site”) or visit the AMOE Page (defined below) to participate in the Game. NOTE: Participation through the App and Game Site is available only to current T-Mobile customers (except T-Mobile pre-paid customers, who may only play through the App or the AMOE Page); non-customers may participate in the Game, but must do so using the AMOE Page. AMOE Page and Game Site Participants have the same odds of winning as those Participants entering via the App.\n\n1. T-Mobile Customers:\n\n(i) Via the T-Mobile Tuesdays App:\n\nThe T-Mobile Tuesdays App is available for iOS and Android download through iTunes and Google Play. Once the App is successfully downloaded, new Participants may begin the registration process required in order to participate in this Game, which includes accepting the App Terms & Conditions. Standard message & data rates may apply. Participants will be asked to enter a T-Mobile phone number. Note: If a Participant becomes signed out by any means, they will need to go through registration again.\n\nParticipants who enter a valid and eligible T-Mobile phone number will be sent an SMS text with a confirmation code. This code must be entered into the “ENTER YOUR CONFIRMATION CODE” field in order to confirm their phone number (you can choose to participate without receiving an SMS text by visiting the AMOE Page described below). Upon successfully entering the confirmation code and selecting “ENTER” or similar button, the Participant, if validated, will see a confirmation screen. Upon clicking “START IT UP” or similar button, the Game will open for the Participant to begin. Already registered Participants may open the App and will not need to go through the verification process again. Participants should then tap “PLAY NOW” to agree to the Official Rules and to play the Game animation. Winning the Game is determined based on the time at which you clicked the “PLAY NOW” or similar button and not on the outcome of the Game animation. The Game animation is purely for entertainment purposes. You will be shown a screen that indicates if you are a winner. If you are a winner, follow the instructions to redeem your prize.\n\nIf during registration a Participant provides information indicating that they are not eligible (or fail to provide any required information), they will be shown a screen which will inform them they are not eligible to participate in the Game using the App (because they are not a T-Mobile customer or they are not an eligible T-Mobile customer). If such a potential Participant satisfies the eligibility requirements for the Game, he or she may participate using the AMOE Page as described in subsection (B), below.\n\n(ii) Via the T-Mobile Tuesdays Game Site\n\nThe Game Site will be accessible at www.T-MobileTuesdays.com via a computer or web-enabled mobile device. New Participants may go to the Game Site and, if accessing on the “Promotion Day,” may be prompted with an optional new user video and tutorial screens before arriving to the home screen. From the home screen, the Participant may click “PLAY NOW” which will take the user to a separate T-Mobile website (“Sign-in Site”). The Sign-in Site will ask Participants to either “Log in with T-Mobile ID” using their T-Mobile phone number and password or to “Sign up for a T-Mobile ID” and follow steps for T-Mobile ID registration. Once Participants have successfully logged in or registered from the Sign-in Site, they will be taken back to the Game Site to accept current Terms & Conditions if they have not done so already.\n\nAfter accepting the Terms & Conditions, Participants will be brought back to the home screen and should click “PLAY NOW” to accept the Official Rules and to play the Game animation. Winning the Game is determined based on the time at which you clicked “PLAY NOW” and not on the outcome of the Game animation. The Game animation is purely for entertainment purposes. You will be shown a screen that indicates if you are a winner. If you are a winner, follow the instructions to redeem your prize.\n\nIf during registration a Participant provides information indicating that they are not eligible (or fail to provide any required information), they will be shown a screen which will inform them that they are not eligible to participate in the Game using the Game Site (because they are not a T-Mobile customer or they are not an eligible T-Mobile customer). If such a potential Participant satisfies the eligibility requirements for the Game, he or she may participate using the AMOE Page as described in subsection (B), below.\n\nB. Non-T-Mobile Customer Play. During the Promotion Day, anyone who is eligible (see Eligibility section, above) can visit amoe.t-mobiletuesdays.com (“AMOE Page”) and follow the instructions to register and receive one (1) Game play.\n\nParticipants must provide all data requested on the registration form, including their first name, last name, email address, phone number (including area code), physical address (including street, city, state and zip; no P.O. boxes) and agree to the Official Rules, in order to receive one (1) Game play. You will be shown a screen that indicates if you are a winner. If you are a winner, you will receive an email at the address provided during registration with instructions to follow to redeem your prize. Neither Sponsor nor any other Released Party or wireless carrier will be responsible for incomplete, lost, late, illegible or misdirected participation.\n\nThere is a limit of one (1) Game play per person/valid email/mobile number. Any attempted participation outside of the Promotion Day, or attempts to participate in excess of the limits stated herein (including, without limitation, by providing multiple sets of or false contact information or registering for multiple user accounts) are void and Participant may be disqualified in Sponsor’s sole discretion. Sponsor’s clock for the App, the Game Site and AMOE Page shall be the official timekeeper of the Game. Those who do not abide by these Official Rules or the instructions of Sponsor or its representatives and provide all required information may, in Sponsor’s sole discretion, be disqualified and any participation by such person void.\n\nAll Participants are required to comply with the FTC Guides Concerning the Use of Endorsements and Testimonials in Advertising at 16 CFR 255 (available at http://www.ftc.gov/sites/default/files/attachments/press-releases/ftc-publishes-final-guides-governing-endorsements-testimonials/091005revisedendorsementguides.pdf). These obligations include disclosing in any social media post or communication, or any other communication, that they make about the Game, Sponsor or the event, that they are a Participant in the Game if the post or communication is incentivized by Sponsor (e.g., if Sponsor gives you a Game play or extra chance to play the Game in exchange for you posting a comment about Sponsor or the Game).\n\nThe registration information provided is subject to Sponsor’s Privacy Policy available at http://www.t-mobile.com/company/website/privacypolicy.aspx.\n\nSponsor may prohibit a Participant from participating in the Game and/or winning prizes if, in its sole discretion, it determines that said Participant is attempting to undermine the legitimate operation of the Game by participating via more than one method (App, the Game Site and/or the AMOE Page), by cheating, hacking, deception or other unfair practices (including the use of automated quick entry programs) or intending to annoy, abuse, threaten or harass any other Participants or Sponsor or its agents, or if Participant has or has attempted to submit malicious code, .exe files or any file that contains malicious code.\n\n4. PRIZE CLAIM PROCESS & VERIFICATION OF THE POTENTIAL WINNERS: Upon winning a prize in the Game, a potential winner will receive a message that includes instructions to claim and receive the prize. Potential winner must follow all on-screen links and instructions to complete the prize claim and verification processes or the prize will be forfeited. The initial prize-claim process must be completed by the date specified below for the applicable prize. Following completion of this initial prize-claim process, potential winners may then (in Sponsor’s sole discretion) be required to complete, have notarized and return an Affidavit of Eligibility and Publicity/Liability Release, where legal, a guest release (when the prize includes a guest(s)) and, as applicable, an IRS Form W-9 and any other documents that the Sponsor may request (collectively the “Prize Claim Documents”) by the deadline specified below for the applicable prize. If the potential winner does not complete the initial prize-claim process or does not provide the Sponsor with the required Prize Claim Documents by the specified deadline and in accordance with these Official Rules and Sponsor’s instructions at that time, the prize may be forfeited and, in that case, will not be awarded to an alternate winner. Any failure to comply with these Official Rules or failure to properly claim a prize or to complete and return required Prize Claim Documents by the deadline set by Sponsor will result in disqualification and that prize will go unawarded. If Sponsor so elects, a potential prize winner may be required to submit to, and cooperate in, a confidential background check to confirm eligibility, security requirements set by Sponsor or a Prize Partner and to help ensure that the use of any such person in advertising or publicity for the Game will not bring Sponsor or a Prize Partner into public disrepute, contempt, scandal or ridicule, or reflect unfavorably on the Game or the Sponsor or on a Prize Partner, all as determined by Sponsor in its sole discretion.\n\nIf a winner is eligible to participate in the Game, but is under the age of majority in his/her legal jurisdiction of residence (a “Minor”), the prize may be awarded to or in the name of winner’s parent/legal guardian, who must execute all documents and agree to all obligations and undertakings of a winner, both on behalf of himself/herself and the Minor Participant, or the prize may be forfeited in its entirety.\n\nIn the event of a dispute as to the identity or eligibility of a winner based on the mobile phone number submitted, the prize will be awarded to the T-Mobile telephone number primary account contact, or for an email account, shall be the natural person to whom the applicable email address has been assigned by the Internet access provider, service provider or other online organization responsible for assigning email addresses for the domain associated with the submitted email address (each an “Authorized Account Holder”) at the time the play is submitted, but only if that person meets all other eligibility criteria detailed in these Official Rules.\n\n5. PRIZE(S); ODDS OF WINNING; APPROXIMATE RETAIL VALUE (“ARV”):\n\nOdds of winning a prize will depend on the time a Participant clicks on “Play Now” and the randomly seeded time for any prize available. Game Site, AMOE Page and App Participants have the same odds of winning and prizes for all such methods are awarded through the same systems. There is a limit of one (1) prize per Participant.\n\nIf you receive a message indicating that you are a winner of one of the following prizes, you (or your parent/legal guardian if you are a Minor), must follow the on-screen instructions to claim your prize (as described in more detail above) no later than the deadline for the applicable prize set forth below.\n\nOne Grand Prize: The winner of the Grand Prize, subject to verification, will receive a trip for winner and three (3) adult guests to Las Vegas, NV and a check for $2,793 that winner can use for taxes and or in his/her sole discretion. Trip includes round trip coach class air travel from the airport nearest winner’s home in the Territory to Las Vegas, NV; two (2) nights hotel accommodations (two (2) standard double-occupancy rooms) in Sponsor’s sole discretion; $1,000 spending money for meal and/or expenses; four (4) concert tickets up to a total of $800; four (4) Lyft credits up to $250 each. Trip must be completed by July 1, 2017. Approximate retail value (“ARV”) of the entire prize is $9,193. The actual value will be determined by the winner’s location of departure. Potential winner (or his/her parent/legal guardian if winner is a Minor) must claim this prize by 11:59 p.m. ET on Wednesday, January 4, 2017, and completed Prize Claim Documents must be received by Sponsor by 11:59 p.m. ET on Tuesday, January 10, 2017. To use the Lyft credit, a winner must follow the instructions in the email to add the Lyft credit to the winner’s Lyft app (available in your app store for free) to be valid for use. To create a Lyft account, request a ride, or have a ride requested for you, you must be at least 18 years old. Lyft credits expire on July 1, 2017. Lyft credits can only be used on the Lyft platform and is not redeemable for cash. Lyft not available in all locations. Not available in Puerto Rico. Tips not included. Restrictions apply. Use of Lyft and Lyft credits subject to Lyft’s Terms of Service available at www.lyft.com/terms. See “Additional Requirements Applicable to Lyft Credit Use” below. Trip is subject to “Additional Terms Applicable to Grand Prize” below.\n\nFifty (50) First Prizes: Each winner of the First Prize, subject to verification, will receive a $200 Lyft credit and a check for $200. Some restrictions may apply. ARV: $400. Potential winner (or his/her parent/legal guardian if winner is a Minor) must claim this prize by 4:59 a.m. ET on December 28, 2016. Once verified as a winner, the Lyft credit will be emailed to winner for arrival by December 30, 2016, and the cash prize will be sent to the winner in January 2017 to the contact information provided during the prize claim process. To use the Lyft credit, a winner must follow the instructions in the email to add the Lyft credit to the winner’s Lyft app (available in your app store for free) to be valid for use. To create a Lyft account, request a ride, or have a ride requested for you, you must be at least 18 years old. Tips not included. Restrictions apply. Lyft credits expire on February 7, 2017. Lyft credits can only be used on the Lyft platform and is not redeemable for cash. Lyft not available in all locations. Not available in Puerto Rico. Use of Lyft and Lyft credits subject to Lyft’s Terms of Service available at www.lyft.com/terms. See “Additional Requirements Applicable to Lyft Credit Use” below.\n\nOne Hundred Fifty (150) Second Prizes: Each winner of the Second Prize, subject to verification, will receive a $50 Lyft credit and a check for $50 that winner can use in his/her sole discretion. Some restrictions may apply. ARV: $100. Potential winner (or his/her parent/legal guardian if winner is a Minor) must claim this prize by 4:59 a.m. ET on December 28, 2016. Once verified as a winner, the Lyft credit will be emailed to winner for arrival by December 30, 2016, and the cash prize will be sent to the winner in January 2017 to the address provided during the prize claim process. To use the Lyft credit, a winner must follow the instructions in the email to add the Lyft credit to the winner’s Lyft app (available in your app store for free) to be valid for use. To create a Lyft account, request a ride, or have a ride requested for you, you must be at least 18 years old. Tips not included. Restrictions apply. Lyft credits expire on February 7, 2017. Lyft credits can only be used on the Lyft platform and is not redeemable for cash. Lyft not available in all locations. Not available in Puerto Rico. Use of Lyft and Lyft credits subject to Lyft’s Terms of Service available at www.lyft.com/terms. See “Additional Requirements Applicable to Lyft Credit Use” below.\n\nTotal number of prizes available: 201; the total ARV of all available prizes is $44,193.\n\nTerms applicable to all prizes: All prize details not stated in the above prize descriptions will be determined by Sponsor (or the applicable Prize Partner) in its sole discretion. Each winner will be solely responsible for all applicable federal, state and local taxes associated with the acceptance, receipt and use of the prize. Prize(s) consists only of items/amounts specifically listed. Any and all costs, fees or expenses related to participating in the Game and claiming or using a prize, unless otherwise specifically set forth herein as part of the prize, are the sole responsibility of the applicable winner. Certain conditions and restrictions may apply. Prizes are nontransferable and no substitution or cash equivalent is allowed, except in Sponsor’s sole discretion. Sponsor reserves the right to substitute a prize(s) of equal or greater approximate retail value for any reason. Each winner may be issued a 1099 tax form for the actual value of his/her prize. If a winner does not accept or use the entire prize, the unaccepted or unused part of the prize will be forfeited and the Released Parties will have no further obligation with respect to that prize or portion of the prize. The Released Parties will not replace any lost, mutilated or stolen prizes or prize elements or any prize elements that are undeliverable or do not reach the winner because of an incorrect or changed address or other contact information. Prizes will be mailed (where applicable) only to the verified winner’s address within the Territory unless Sponsor, in its sole discretion, agrees otherwise. If Sponsor determines at any time in its sole discretion that a winner or potential winner is ineligible or in violation of these Official Rules, Sponsor reserves the right in its sole discretion to disqualify that person, even if he or she has been notified or announced as a winner.\n\nAdditional Terms Applicable to Grand Prize: Any and all costs, fees (including, but not limited to, luggage fees and transportation between winner’s home and departure airport), and expenses not expressly stated in the prize description are the sole responsibility of the prize winner. Any difference between the approximate retail value and the actual value will not be awarded and any difference will not be refunded. Sponsor does not represent that any money provided as part of a prize to help towards taxes will be sufficient to cover any winner’s potential tax liability associated with winning a prize. No insurance is provided as part of the prize, and obtaining any insurance, such as but not limited to travel insurance, health, accident or medical insurance, and property loss or damage insurance is the sole responsibility of the winner and/or winner’s guest(s) (if any). Travel and other arrangements will be determined by Sponsor or Prize Partner (where applicable). If winner is a Minor, winner’s guest must be winner’s parent/legal guardian; and if winner’s guest is a Minor, guest must be winner’s child or legal ward. Air travel will be round trip (originate from and end at the same airport) coach class from and to an airport selected by Sponsor. Reservations must be made and tickets issued prior to travel. Tickets and certificates are non-refundable and non-transferable and are not redeemable for cash. Changes to reservations are not permitted. Prize winner and guest(s) must travel together on the same itinerary and are solely responsible for having any required travel-related documents (including valid government-issued photo ID and/or any required passport or visa) prior to departure as well as fulfilling any/all travel and security requirements (including but not limited to any shots or other health requirements necessary to visit certain destinations). Sponsor or Prize Partner(s) reserve the right in their respective sole discretion to designate all flight/travel particulars and route or routes (as the case may be). Failure to complete the trip portion of the prize (or any portion of the prize) does not relieve the prize winner of their tax obligations associated with winning the trip prize. Flight schedules are subject to change without notice. In the event a winner lives within one hundred (100) miles of the destination for their prize, air travel will not be included in the trip prize and any such winner will be compensated a total of five hundred dollars ($500) in lieu of air travel, for any alternate travel expenses. No Released Party will be liable for any missed opportunities or expenses incurred as a consequence of flight cancellation/delay or ground transportation delay. If a winner (and/or the winner’s guests) is not able to participate in any portion of a travel prize, that unused portion will not be substituted for cash or any other prize. Prize winners may be required to provide a current valid major credit card at time of hotel check-in to cover incidentals, and any and all costs, fees and expenses not expressly stated in the prize description. Restrictions and/or blackout dates may apply to some trip prizes. Once a guest is determined, that guest cannot be changed without the express consent of Sponsor, which may be withheld for any reason. Each winner (and each guest) agrees to maintain their behavior in accordance with all applicable laws and generally accepted social practices in connection with participation in any prize-related activity. Prize winners understand and agree that Sponsor or the applicable Prize Partner has the right, in their sole discretion, to disqualify and remove a prize winner and/or any guest from any activity at any time if that winner or guest’s behavior at any point is uncooperative, disruptive, or may or does cause damage to person, property or the reputation of Sponsor or the Prize Partner, or otherwise violates the policies of the Sponsor or Prize Partner. The prize winner is solely responsible for the behavior of winner’s guests. If any activity relating to any prize is cancelled or postponed for any reason, the balance of that prize will be awarded in full satisfaction of the prize awarded.\n\nAdditional Requirements Applicable to Lyft Credit Use: To use Lyft, you will need the free Lyft app, available in your app store (free). To create a Lyft account, request a ride or have a ride requested for you, you must be at least 18 years old. A passenger can be under the age of 18 as long as they're accompanied by an adult. To download the app you'll need to go to your local app store from your smartphone. Or you can go to https://www.lyft.com/app and enter your mobile device number and a link to download the app will be sent to your mobile device via text message (message and data rates may apply). Once you have downloaded the app you will need to sign up for a Lyft account. To create an account you will open the app and select “Sign Up.” You will be asked to allow location access, which will match you with available drivers in your area. Select “OK.” You will need to sign up with either your Facebook account or mobile number. If you sign up using your Facebook account, Lyft will use your Facebook name, picture and email. If you sign up with your email address, enter your last name and email address, and then click “Next.” During signup, you will be required to provide a credit card for payment purposes; however, any credit balance you have on your account will be used first for payments before your credit card is charged. The cost for your rides will automatically be deducted from your credit balance until the credit is depleted. This will be reflected on the confirmation/receipt screens. Once the full credit balance has been used, payment for rides will be made with the credit card associated with your account.\n\n6. GENERAL CONDITIONS: By playing, Participants unconditionally: (1) agree to be bound by these Official Rules and the decisions of Sponsor and/or Administrator (defined below) and any independent judge(s) used by Sponsor, which will be binding and final in all matters pertaining to the Game; (2) grant (and agree to confirm that grant in writing) Sponsor and those acting under its authority the right and permission to use his/her name, nickname, entry information, picture, photograph, likeness, voice, video, biographical and personal information and written or verbal statements, at any time or times in perpetuity for advertising, trade, publicity and promotional purposes, in all media now known or hereafter discovered, worldwide, and on the Internet and World Wide Web, without notice, review or approval and without additional compensation, notification or permission, unless prohibited by law; and (3) agree that Participant’s wireless service provider may release any Participant’s phone number(s) to the Sponsor or its designees for use in contacting Participant and determining Participant’s eligibility to receive a prize.\n\n7. LIMITATIONS OF LIABILITY: The Released Parties are not responsible for, and specifically disclaim any liability for or arising out of, any of the following regardless of cause, in connection with the Game: (1) any incorrect or inaccurate information, whether caused by Participants, wireless carriers, Internet Service Providers (“ISP”) or unauthorized human intervention; (2) technical difficulties or failures of any kind including, but not limited to, malfunctions, interruptions or disconnections in transmissions or connections, phone lines, network hardware or software, computers, equipment, programming errors, cable, satellite, cellular tower or ISP or wireless carriers; (3) bugs, viruses, worms, Trojan horses or similar malicious attacks; (4) typographical, printing, network, mechanical, electronic, technical, human or other errors or malfunctions; (5) any responsibility and/or liability with respect to the Game and/or the prize (including any property loss, damage, personal injury or death) in connection with participation in this Game, the offering or announcement of any prize, or the acceptance/possession, use/misuse and/or defects of the prize awarded herein; (6) lost, incomplete, late, misdirected, garbled, undelivered, incomplete, stolen or mutilated transactions, subscriptions or entries; or garbled, lost, misrouted or scrambled transmissions; or (7) unauthorized human and/or mechanical intervention in the Game or any other part of the participation process in this Game. The Released Parties shall not be liable for any injury, damage, loss, expense, accident, delay, inconvenience or irregularity that may be caused or contributed to (1) by any wrongful, negligent or unauthorized act or omission on the part of any prize supplier or any of its agents, airlines, servants, employees or independent contractors, (2) by any wrongful, negligent or unauthorized act or omission on the part of any other person or entity not an employee of the Released Parties, or (3) by any other cause, condition or event whatsoever beyond the control of the Released Parties or their parents, subsidiaries and affiliated companies. CAUTION: Any attempt by a person or entity to damage any website or undermine the legitimate operation of this Game may be a violation of criminal and/or civil laws and, should such an attempt be made, Sponsor reserves the right to seek damages and/or other remedies (including attorneys’ fees) from any such individual(s) or entity(ies) responsible for the attempt to the fullest extent permitted by law.\n\n8. RELEASE/WAIVER/INDEMNITY: BY ENTERING, EACH PARTICIPANT (AND GUEST, IF APPLICABLE) AND EACH OF THEIR AGENTS, ASSIGNEES, EXECUTORS AND SUCCESSORS AGREE TO INDEMNIFY, DEFEND, HOLD HARMLESS AND FULLY RELEASE AND FOREVER DISCHARGE EACH OF THE RELEASED PARTIES AND THEIR RESPECTIVE SHAREHOLDERS FROM AND AGAINST ANY AND ALL LIABILITIES, COSTS, CLAIMS, ALLEGED CLAIMS, DEMANDS, DUTIES, RIGHTS, AGREEMENTS, PROMISES, DAMAGES, INJURIES, LOSSES, EXPENSES, LIENS AND DEBT ACTIONS OF ANY KIND, INCLUDING, WITHOUT LIMITATION, ATTORNEYS’ FEES, WHETHER NOW KNOWN OR UNKNOWN, UNFORESEEN OR FORESEEN, ARISING OUT OF OR IN ANY WAY CONNECTED WITH, DIRECTLY OR INDIRECTLY, PARTICIPATION IN THE GAME, INCLUDING WITHOUT LIMITATION, PERSONAL INJURY OR DEATH, LOSS OF ENJOYMENT, OR OTHER HARM OR LOSS OF ANY NATURE WHATSOEVER CAUSED OR CONTRIBUTED TO BY OR ARISING OUT OF PARTICIPATION IN THIS GAME, OR RESULTING FROM ACCEPTANCE, POSSESSION, QUALITY, USE OR MISUSE OF A PRIZE, OR ANY PORTION THEREOF, OR PREPARATION FOR OR TRAVEL TO OR FROM ANY PRIZE-RELATED OR GAME-RELATED ACTIVITY. THE RELEASED PARTIES ARE NOT RESPONSIBLE FOR ANY ADDITIONAL EXPENSES, OMISSIONS OR DELAYS RESULTING FROM ANY ACTS OF ANY GOVERNMENT OR AUTHORITY. IF APPLICABLE, THE PRIZE WINNER ACKNOWLEDGES THAT HE/SHE IS SOLELY RESPONSIBLE FOR ANY ACTIONS, CLAIMS OR LIABILITIES OF HIS/HER GUEST(S) RELATED TO ANY PRIZE-RELATED ACTIVITY, INCLUDING, WITHOUT LIMITATION, ANY ACTIONS, CLAIMS OR LIABILITIES RELATED TO THE USE OF THE PRIZE.\n\n9. DISCLAIMER OF WARRANTIES. THE RELEASED PARTIES MAKE NO WARRANTIES, AND HEREBY DISCLAIM ANY AND ALL WARRANTIES, EXPRESSED OR IMPLIED, CONCERNING ANY PRIZE IN CONNECTION WITH THE GAME. WITHOUT LIMITING THE GENERALITY OF THE FOREGOING, SUCH PRIZES ARE PROVIDED \"AS IS\" WITHOUT WARRANTY OF ANY KIND, EITHER EXPRESSED OR IMPLIED, AND THE RELEASED PARTIES HEREBY DISCLAIM ALL SUCH WARRANTIES, INCLUDING BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND/OR NON-INFRINGEMENT. SOME STATES DO NOT ALLOW THE EXCLUSION OF IMPLIED WARRANTIES, SO THE ABOVE EXCLUSION MAY NOT APPLY TO ALL PARTICIPANTS.\n\n10. MISCELLANEOUS:\n\nA. Disqualification. It is the Participant’s sole responsibility to ensure that they have complied in full with all conditions and requirements contained in these Official Rules. If any potential winner is found to be ineligible, or if they have not complied with these Official Rules, or declines a prize for any reason prior to award, such potential winner will be disqualified and the prize forfeited. No mechanically reproduced, illegible, incomplete, forged, software-generated, third party or other automated or robotic participation, in whole or in part, will be accepted. Entries made by any individual or any entity other than the Participant and/or originating by any other mechanism, including but not limited to commercial promotion subscription, notification, and/or entering services, will be declared invalid and disqualified from this Game. Sponsor reserves the right in its sole discretion to disqualify any individual who is found to be tampering with the entry process or the operation of the Game; to be acting in violation of these Official Rules; or to be acting in an unsportsmanlike or disruptive manner, or with the intent to disrupt or undermine the legitimate operation of the Game, or to annoy, abuse, threaten or harass any other person. The Sponsor reserves the right to seek damages and other remedies from any such person to the fullest extent permitted by law.\n\nB. Force Majeure/Printing and Production Errors. Sponsor reserves the right, without prior notice and at any time, to terminate the Game, in whole or in part, or modify, suspend or extend the Game or Game materials in any way, if it determines in its sole discretion, that any Game materials and/or Prize Claim Documents reflect printing or other errors or if it determines, in its sole discretion, that the Game, App, AMOE Page or Game Site is impaired or corrupted or that fraud or technical problems, failures, malfunctions or errors (including, without limitation, computer viruses or other deleterious programs or materials, unauthorized human or mechanical intervention, glitches or printing or production errors) have destroyed or severely undermined the proper play, integrity and/or feasibility of the Game. In the event Sponsor is prevented from continuing with the Game as contemplated herein by any event beyond its control, including but not limited to fire, flood, natural or man-made health epidemic, earthquake, explosion, labor dispute or strike, act of God or public enemy, satellite or equipment failure, riot or civil disturbance, terrorist threat or activity, war (declared or undeclared) or any federal, state, provincial or local government law, order or regulation, public health crisis, order of any court or jurisdiction, or other cause not reasonably within Sponsor’s control, then Sponsor shall have the right to modify, suspend, extend or terminate the Game. Only the type and quantity of prizes described in these Official Rules will be awarded. The sole responsibility and liability for any invalid or irregular Game play is replacement with another Game play (time permitted and as solely determined by Sponsor). Replacement shall be the sole and exclusive remedy under such circumstances. In no event will more prizes be awarded than set forth in these Official Rules. If, due to printing, digital, computer programming, hardware or software, or production errors or for any reason, more potential winners in any prize category come forward seeking to claim prizes in excess of the number of each type of prize as set forth in these Official Rules, the winners, or remaining winners, as the case may be, of the advertised number of prizes available in the prize category in question may be selected in a random drawing from among all persons making purportedly valid claims for such prize(s) in that prize category. Inclusion in such drawing shall be each Participant’s sole and exclusive remedy under such circumstances.\n\nC. Invalidity. The invalidity or unenforceability of any provision of these Official Rules shall not affect the validity or enforceability of any other provision. In the event that any provision is determined to be invalid or otherwise unenforceable or illegal, these Official Rules shall otherwise remain in effect and shall be construed in accordance with their terms as if the invalid or illegal provision were not contained herein. Headings and captions are used in these Official Rules solely for ease of reference, and shall not be deemed to affect in any manner the meaning or intent of these Official Rules or any provision hereof. These Official Rules cannot be modified or amended in any way except in writing by the Sponsor.\n\n11. DISPUTES/CHOICE OF LAW: Except where prohibited, Participants agree that: (1) any and all disputes, claims and causes of action arising out of or connected with the Game (including any and all disputes, claims and causes of action arising out of or connected with the prizes, the availability or use or same; or the conduct of the Game), shall be resolved individually, without resort to any form of class action, and exclusively by arbitration pursuant to the Rules of the American Arbitration Association, then effective, and (2) waive any right to seek or obtain injunctive or other equitable relief, and (3) any and all claims, judgments and awards shall be limited to actual out-of-pocket costs incurred, including costs associated with entering Game (if any), but in no event attorneys’ fees; and (4) under no circumstances will a Participant be permitted to obtain awards for, and Participant hereby waives all rights to claim, punitive, incidental, special, exemplary and consequential damages and any other damages, other than for actual out-of-pocket expenses (if any), and any and all rights to have damages multiplied or otherwise increased. All issues and questions concerning the construction, validity, interpretation and enforceability of these Official Rules, or the rights and obligations of Participant and/or Sponsor in connection with the Game, shall be governed by, and construed in accordance with, the laws of the State of Washington, without regard for conflicts of law doctrine of Washington or any other jurisdiction, and all proceedings shall take place in King County, Washington.\n\n12. OFFICIAL RULES. These Official Rules will be available at the Game Site (www.T-MobileTuesdays.com) during the Promotion Day. To receive a copy of the Official Rules, mail a self-addressed, stamped envelope to Redemption Center: T-Mobile Tuesdays Game – Week #30 Official Rules Request, P.O. Box 1561, Chicago, IL 60690. All requests must be received by June 30, 2017. Vermont residents with a return address located in Vermont may omit return postage. Limit one (1) request per outer envelope.\n\n13. WINNERS LIST. For a list of Official Winners whose prize value exceeds $600 (“List”), mail a #10 SASE to Redemption Center: T-Mobile Tuesdays Game – Week #30 Winners List Request, P.O. Box 1561, Chicago, IL 60690. All requests must be postmarked by March 30, 2017, and received by June 30, 2017. Limit one (1) request per outer envelope.\n\n14. SPONSOR: T-Mobile USA, Inc., 12920 SE 38th Street, Bellevue, Washington, USA 98006. Administrator: The Marketing Store Worldwide, LP, 55 W. Monroe, Chicago, IL 60603. The Game is in no way sponsored, endorsed, or administered by, or associated with, Apple Inc.\n\n© 2016 T-Mobile USA, Inc. All Rights Reserved. By participating, you understand that you are providing your information to the Sponsor and not to the Prize Partners.",
      "resource-id": "com.tmobile.tuesdays:id/scrollText",
      "ancestors": [
        "android.widget.TextView",
        "android.view.View",
        "java.lang.Object"
      ],
      "clickable": true,
      "class": "com.tmobile.tuesdays.components.textview.CustomFontTextView",
      "bounds": [
        56,
        459,
        1384,
        2560
      ],
      "componentLabel": "Text"
    }
  ]
}